kernel/mm/fast_alloc_page/fast_alloc_page.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2025-01-05 Sun 14:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>物理页面分配之快速路径</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cauchy(pqy7172@gmail.com)">
<link rel="stylesheet" href="../../../org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">物理页面分配之快速路径</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9b4071f">1. alloc_pages_noprof</a></li>
<li><a href="#orga07c6d4">2. alloc_pages_mpol_noprof</a>
<ul>
<li><a href="#org80344ba">2.1. 第一部分</a></li>
<li><a href="#orgf7fbc40">2.2. 第二部分</a></li>
<li><a href="#org043ad81">2.3. 第三部分</a></li>
</ul>
</li>
<li><a href="#org750f99c">3. __alloc_pages_noprof</a>
<ul>
<li><a href="#orgbaacee7">3.1. 第一部分</a></li>
<li><a href="#org9fdbd85">3.2. 第二部分</a></li>
<li><a href="#org8c86059">3.3. 第三部分</a></li>
</ul>
</li>
<li><a href="#orgfdc5cd3">4. get_page_from_freelist</a>
<ul>
<li><a href="#orgab9e573">4.1. 第一部分</a></li>
<li><a href="#org9f84eb1">4.2. 第二部分</a></li>
<li><a href="#org3f0019b">4.3. 第三部分</a></li>
</ul>
</li>
<li><a href="#orgd88a683">5. rmqueue</a></li>
<li><a href="#org59ac59f">6. 附节</a>
<ul>
<li><a href="#orge835b8e">6.1. get_vma_policy生成ilx</a></li>
</ul>
</li>
<li><a href="#org8fa76d7">7. rmqueue</a></li>
<li><a href="#org0ffaef9">8. 附节</a>
<ul>
<li><a href="#orgab61376">8.1. get_vma_policy生成ilx</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
本文分析在理想情况下，也就是没有内存短缺时内核通过伙伴系统分配物理页面的流程。物理页面分配的接口包括alloc_pages，这个函数在成功分配时返回的是第一个页面的page数据结构。另外一类接口是__get_free_pages，返回的是内核空间的虚拟地址。本文主要以alloc_pages为入口，分析内核是如何在理想情况下经过快速路径去分配物理页面的，alloc_pages就是一个简单的宏定义，主要调用alloc_pages_noprof。
</p>
