kernel/mm/fast_alloc_page/fast_alloc_page.html

<div id="outline-container-orga07c6d4" class="outline-2">
<h2 id="orga07c6d4"><span class="section-number-2">2.</span> alloc_pages_mpol_noprof</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>原型：</b>
</p>
<pre class="example" id="org5e1af94">
struct page *alloc_pages_mpol_noprof(gfp_t gfp, unsigned int order,
		struct mempolicy *pol, pgoff_t ilx, int nid)
</pre>

<p>
<b>作用：</b><br>
分配2^order个页面，第一个参数是内存分配标志gfp，最后一个参数nid是前面使用numa_node_id获得的该运行CPU所在的node。针对第四个参数ilx，在交错策略下时，ilx表明是否使用task_struct里的il_prev作为依据来选择内存分配的节点，为NO_INTERLEAVE_INDEX时表明使用task_struct:ilx_prev，而当通过get_vma_policy来获得一个有效的ilx值时就使用这个值来确定如何选择哪个节点来分配内存。第三个参数pol就是前面通过get_task_policy获得的内存策略，当然还有其它的调用路径通过get_vma_policy来获得内存策略，这在本文<a href="#orge835b8e">附节: get_vma_policy生成ilx</a>中有介绍。
</p>

<p>
<b>详细分析：</b><br>
alloc_pages_mpol_noprof主要分为三个部分来完成其功能：
</p>
<ul class="org-ul">
<li>第一部分是通过policy_nodemask函数获得在哪个（些）节点上分配内存，由nodemask_t类型的指针nodemask表示，并且返回在哪个目标节点上分配的节点号，由nid表示。</li>

<li>第二部分是针对不同的情况调用不同的分配函数，一种是针对MPOL_PREFERRED_MANY内存策略，调用alloc_pages_preferred_many分配内存，而针对大页内存分配的情况会做一些特殊处理，然后再调用__alloc_pages_node_noprof完成内存分配，最后一种情况就是通过__alloc_pages_noprof完成除前面两种特殊情况的“正常”页面分配。</li>

<li>第三部分是针对交错分配的方式，要更新一些统计信息。</li>
</ul>

<p>
以下继续针对这三部分的代码详细分析。
</p>
</div>
