kernel/mm/fast_alloc_page/fast_alloc_page.html

<div id="outline-container-org80344ba" class="outline-3">
<h3 id="org80344ba"><span class="section-number-3">2.1.</span> 第一部分</h3>
<div class="outline-text-3" id="text-2-1">
<p>
这部分代码确定分配的节点mask以及目标节点的节点号，代码如下：
</p>
<pre class="example" id="orgfe8af32">
nodemask_t *nodemask;
nodemask = policy_nodemask(gfp, pol, ilx, &amp;nid);
</pre>
<p>
可以看到主要就是调用了policy_nodemask来确定nodemask以及nid，注意这里的nid是alloc_pages_mpol_noprof的最后一个参数nid的地址，nid的值通过numa_node_id获得代表当前运行CPU所在的节点，这里传入nid的地址，意味着policy_nodemask函数可能会修改nid的值。返回的nodemask表示可以在哪些节点上分配内存，而返回的nid是首选的节点。
</p>

<p>
policy_nodemask根据前面介绍的NUMA内存策略分几种case来给nodemask和nid赋予不同的值，其原型如下：
</p>
<pre class="example" id="org131fc90">
static nodemask_t *policy_nodemask(gfp_t gfp, struct mempolicy *pol,
				   pgoff_t ilx, int *nid)
</pre>

<p>
<b>第一种case MPOL_PREFERRED：</b>
</p>
<pre class="example" id="org0445050">
nodemask_t *nodemask = NULL;

switch (pol-&gt;mode) {
case MPOL_PREFERRED:
	/* Override input node id */
	*nid = first_node(pol-&gt;nodes);
	break;
</pre>
<p>
这种情况只设置了优先使用分配内存的节点号，使用first_node去找到pol-&gt;nodes里第一个置位的bit的序号，从这里也可以看出pol-&gt;nodes这个成员表征了候选的可以用于分配的一些节点，只是说这些节点要按各种不同的策略去选择。
</p>

<p>
<b>第二种case MPOL_PREFERRED_MANY：</b>
</p>
<pre class="example" id="org27504e1">
case MPOL_PREFERRED_MANY:
	nodemask = &amp;pol-&gt;nodes;
	if (pol-&gt;home_node != NUMA_NO_NODE)
		*nid = pol-&gt;home_node;
	break;
</pre>
<p>
这种情况是有nodemask的，因为perferred many就是在一组优先的节点里分配，并且pol-&gt;home_node是有效值时，返回pol里的home_node号作为优先分配的节点。
</p>

<p>
<b>第三种case MPOL_BIND：</b>
</p>
<pre class="example" id="orgaa63d77">
case MPOL_BIND:
	/* Restrict to nodemask (but not on lower zones) */
	if (apply_policy_zone(pol, gfp_zone(gfp)) &amp;&amp;
	    cpuset_nodemask_valid_mems_allowed(&amp;pol-&gt;nodes))
		nodemask = &amp;pol-&gt;nodes;
	if (pol-&gt;home_node != NUMA_NO_NODE)
		*nid = pol-&gt;home_node;
	/*
	 * __GFP_THISNODE shouldn't even be used with the bind policy
	 * because we might easily break the expectation to stay on the
	 * requested node and not break the policy.
	 */
	WARN_ON_ONCE(gfp &amp; __GFP_THISNODE);
	break;
</pre>
<p>
对于使用MPOL_BIND的内存策略，要限制内存策略不能应用到较低序号的zone，这个判断逻辑由apply_policy_zone函数实现，它的第二个参数，调用gfp_zone由gfp标志里去获得分配内存的目标zone号，也就是获得的目标zone号要大于apply_policy_zone里的一个特别的zone号，这时内存策略才生效。这里主要详细分析下gfp_zone的实现，它决定了内存从哪个zone去分配，较为关键。至于本case的代码较为简单。
</p>

<p>
在分析gfp_zone函数前，先介绍内核内存管理涉及到的各种类型的zone：
</p>
<ul class="org-ul">
<li>ZONE_DMA <br>
区域ZONE_DMA用于适应一些旧式设备，这些设备只能通过DMA（直接内存访问）访问低地址的内存（通常在16MB以下），部分旧设备只能访问某个范围内的物理内存地址。如果要在这些设备上进行DMA操作，内存必须分配在这个特定区域内，比如ISA总线设备或早期的DMA控制器。CONFIG_ZONE_DMA配置选项决定是否启用这个zone。</li>

<li>ZONE_DMA32 <br>
区域ZONE_DMA32用于支持能够访问32位地址空间（4GB以下）但不能访问更高地址的设备。一些设备，如32位PCI设备，只能访问4GB以下的内存，因此分配时需要确保内存位于这个范围内。适用于需要低于4G地址范围的64位系统。CONFIG_ZONE_DMA32配置选项决定是否启用该zone。</li>

<li>ZONE_NORMAL <br>
区域ZONE_NORMAL包含可被大多数内核和用户进程直接访问的常规物理内存区域。在大多数情况下，DMA操作和内核直接访问都可以在ZONE_NORMAL中完成，这是标准的内存区域。所有常规的内存操作（除非设备或操作对内存有特殊要求）。</li>

<li>ZONE_HIGHMEM <br>
ZONE_HIGHMEM用于32位系统中超过直接寻址能力的高地址空间。它通过分页机制（如映射页表条目）来访问高于900MB的内存。32位系统只能直接寻址4GB的地址空间，对于大内存机器而言，这样的空间显得不足。因此，把高地址的物理内存放到ZONE_HIGHMEM中，使内核可以通过间接的方式访问它们。在内存大于4GB的32位系统上，通过页表映射方式访问超出寻址能力的内存区域。启用CONFIG_HIGHMEM后可用。</li>

<li><p>
ZONE_MOVABLE <br>
ZONE_MOVABLE主要用于可以迁移的页面，比如用户态内存或页缓存等。在内存卸载和巨页分配时，这个zone有助于提高成功率。通过将可以迁移的内存放在ZONE_MOVABLE，可以确保在需要时有一部分内存可以被迁移或回收，从而进行更灵活的内存管理。例如，大页分配和热插拔内存。用于可热插拔的内存、可移动页面的分配，以及减少不能迁移的分配对系统性能的影响。
</p>

<p>
这种类型类似于ZONE_NORMAL，但是不可移动的页面却只能在ZONE_NORMAL。不过以下有一些情况会存在ZONE_MOVABLE有unmovable页面的情况：
</p>
<ul class="org-ul">
<li>长期钉住的页面是不可移动的，因此在ZONE_MOVABLE里不允许长期钉住页面，当页面先钉住然后通过page fault分配物理页面，这种情况没什么问题，页面会来自正确的zone（避开ZONE_MOVABLE），但是当页面被钉住时有可能地址空间里已经有页面位于ZONE_MOVABLE了，这时会将这些页面迁移到不同zone（避开ZONE_MOVABLE）中，迁移要是失败，钉住页面也会失败。</li>

<li>memblock对于kernelcore/movablecore区域的设置可能会导致ZONE_MOVABLE里有unmovable的页面。</li>
</ul></li>
<li>ZONE_DEVICE <br>
ZONE_DEVICE主要用于特殊的内存设备，如NVDIMM（非易失性双列直插内存模块）或其它直接映射到系统内存的设备。随着硬件的演进，现代系统需要支持直接映射到内存的硬件设备，如持久内存。这些设备可以直接与系统内存交互，通常是可持久化的。如使用非易失性存储器（如 NVDIMM）、显存映射等。启用CONFIG_ZONE_DEVICE后可用。</li>
</ul>

<p>
针对笔者目前环境的配置，zone_type的定义如下：
<a id="org14e5481"></a>
<a id="orgf761cbc"></a>
</p>
<pre class="example" id="orga46e3de">
enum zone_type {
        ZONE_DMA,
        ZONE_DMA32,
        ZONE_NORMAL,
        ZONE_MOVABLE,
        ZONE_DEVICE,
        __MAX_NR_ZONES
};
</pre>

<p>
<a id="org2f225cd"></a>
现在可以介绍gfp_zone函数了，gfp_zone函数的主要作用就是根据传入的gfp标志映射到不同类型的zone，也就是返回zone_type类型的枚举，这些类型前面刚介绍过了。现在看gfp_zone的实现：
</p>
<pre class="example" id="orgf9035e1">
static inline enum zone_type gfp_zone(gfp_t flags)
{
	enum zone_type z;
	int bit = (__force int) (flags &amp; GFP_ZONEMASK);

	z = (GFP_ZONE_TABLE &gt;&gt; (bit * GFP_ZONES_SHIFT)) &amp;
					 ((1 &lt;&lt; GFP_ZONES_SHIFT) - 1);
	VM_BUG_ON((GFP_ZONE_BAD &gt;&gt; bit) &amp; 1);
	return z;
}
</pre>
<p>
GFP_ZONE_TABLE这个宏类似于一个表（数组），它将不同的GFP标志组合映射到不同的zone_type：
</p>
<pre class="example" id="org3868427">
#define GFP_ZONE_TABLE ( \
	(ZONE_NORMAL &lt;&lt; 0 * GFP_ZONES_SHIFT)				       \
	| (OPT_ZONE_DMA &lt;&lt; ___GFP_DMA * GFP_ZONES_SHIFT)		       \
	| (OPT_ZONE_HIGHMEM &lt;&lt; ___GFP_HIGHMEM * GFP_ZONES_SHIFT)	       \
	| (OPT_ZONE_DMA32 &lt;&lt; ___GFP_DMA32 * GFP_ZONES_SHIFT)		       \
	| (ZONE_NORMAL &lt;&lt; ___GFP_MOVABLE * GFP_ZONES_SHIFT)		       \
	| (OPT_ZONE_DMA &lt;&lt; (___GFP_MOVABLE | ___GFP_DMA) * GFP_ZONES_SHIFT)    \
	| (ZONE_MOVABLE &lt;&lt; (___GFP_MOVABLE | ___GFP_HIGHMEM) * GFP_ZONES_SHIFT)\
	| (OPT_ZONE_DMA32 &lt;&lt; (___GFP_MOVABLE | ___GFP_DMA32) * GFP_ZONES_SHIFT)\
)
</pre>
<p>
这样定义出来这个GFP_ZONE_TABLE其实就是一个数字，只是这个数字按每GFP_ZONES_SHIFT个数目的bit
存储一个条目，这个条目通过传入的gfp标志索引，索引出来的是一个zone_type枚举类型的值。
</p>

<p>
这个宏其实定义了一种zone分配的回退机制，举个例子对于条目：
</p>
<pre class="example" id="org537f93e">
ZONE_MOVABLE &lt;&lt; (___GFP_MOVABLE | ___GFP_HIGHMEM) * GFP_ZONES_SHIFT
</pre>
<p>
就是说当传入的GFP标志既设置了__GFP_MOVABLE又设置了__GFP_HIGHMEM，那么最多可以回退到ZONE_MOVABLE这种zone_type，又比如：
</p>
<pre class="example" id="orge4b0194">
(OPT_ZONE_DMA &lt;&lt; (___GFP_MOVABLE | ___GFP_DMA) * GFP_ZONES_SHIFT)
</pre>
<p>
同时gfp标志同时设置了___GFP_MOVABLE和___GFP_DMA，那么最多可以回退到ZONE_DMA这种zone_type（假如配置了CONFIG_ZONE_DMA）。
</p>

<p>
那么可以观察出来，这里GFP_ZONE_TABLE映射出来的值都是往较低的zone_type中映射。
</p>

<p>
但是这里要提请读者注意，所谓“回退到”并不是指可以借用zone_type中较低zone的内存，而是较高的zone需要自己预留内存。
</p>

<p>
当然，有一些标志组合是无法满足的，比如同时设置了DMA+HIGHMEM，DMA本来就要求地址在低内存区，当然无法又在高地址区分配，所有这些搭配由GFP_ZONE_BAD宏表示。
</p>

<p>
GFP_ZONES_SHIFT在笔者的环境就是2，也就是说GFP_ZONE_TABLE中每2个比特保存一个条目。通过这种一个数字就实现表格映射的作用，实际也是一种性能优化，通过逻辑运算一个数字的方式是比查表数组访存要高效的。
</p>

<p>
在没有定义特殊的内存zone（比如DMA，HIGHMEM等）时，都会退化为ZONE_NORMAL：
</p>
<pre class="example" id="org0007b12">
#ifdef CONFIG_HIGHMEM
#define OPT_ZONE_HIGHMEM ZONE_HIGHMEM
#else
#define OPT_ZONE_HIGHMEM ZONE_NORMAL
#endif

#ifdef CONFIG_ZONE_DMA
#define OPT_ZONE_DMA ZONE_DMA
#else
#define OPT_ZONE_DMA ZONE_NORMAL
#endif

#ifdef CONFIG_ZONE_DMA32
#define OPT_ZONE_DMA32 ZONE_DMA32
#else
#define OPT_ZONE_DMA32 ZONE_NORMAL
#endif
</pre>
<p>
再来看gpf_zone函数就简单了首先从flags中拿到低4bit的值：
</p>
<pre class="example" id="org18245f2">
enum zone_type z;
int bit = (__force int) (flags &amp; GFP_ZONEMASK);
</pre>
<p>
为什么是低4bit呢，通过GFP_ZONEMASK的定义就知道了：
</p>
<pre class="example" id="orgf400945">
enum {
        ___GFP_DMA_BIT,
        ___GFP_HIGHMEM_BIT,
        ___GFP_DMA32_BIT,
        ___GFP_MOVABLE_BIT,
        ...
};
#define BIT(nr)			(UL(1) &lt;&lt; (nr))
#define ___GFP_DMA		BIT(___GFP_DMA_BIT)
#define ___GFP_HIGHMEM		BIT(___GFP_HIGHMEM_BIT)
#define ___GFP_DMA32		BIT(___GFP_DMA32_BIT)
#define ___GFP_MOVABLE		BIT(___GFP_MOVABLE_BIT)
#define __GFP_DMA	((__force gfp_t)___GFP_DMA)
#define __GFP_HIGHMEM	((__force gfp_t)___GFP_HIGHMEM)
#define __GFP_DMA32	((__force gfp_t)___GFP_DMA32)
#define __GFP_MOVABLE	((__force gfp_t)___GFP_MOVABLE)  /* ZONE_MOVABLE allowed */
#define GFP_ZONEMASK	(__GFP_DMA|__GFP_HIGHMEM|__GFP_DMA32|__GFP_MOVABLE)
</pre>
<p>
这里可以看到低4个bit其实就是zone修饰符，指明了哪些zone用于分配内存。之前介绍过gfp_t本质是个int，但它具有受限的取值，以限制某些int能进行的运算（范围），但是gfp_t不行。比如上面提到了gfp_t可能的四种值，一个完整的gfp_t值列表如下：
<a id="org4f008de"></a>
</p>
<pre class="example" id="org17a0942">
enum {
	___GFP_DMA_BIT,
	___GFP_HIGHMEM_BIT,
	___GFP_DMA32_BIT,
	___GFP_MOVABLE_BIT,
	___GFP_RECLAIMABLE_BIT,
	___GFP_HIGH_BIT,
	___GFP_IO_BIT,
	___GFP_FS_BIT,
	___GFP_ZERO_BIT,
	___GFP_UNUSED_BIT,	/* 0x200u unused */
	___GFP_DIRECT_RECLAIM_BIT,
	___GFP_KSWAPD_RECLAIM_BIT,
	___GFP_WRITE_BIT,
	___GFP_NOWARN_BIT,
	___GFP_RETRY_MAYFAIL_BIT,
	___GFP_NOFAIL_BIT,
	___GFP_NORETRY_BIT,
	___GFP_MEMALLOC_BIT,
	___GFP_COMP_BIT,
	___GFP_NOMEMALLOC_BIT,
	___GFP_HARDWALL_BIT,
	___GFP_THISNODE_BIT,
	___GFP_ACCOUNT_BIT,
	___GFP_ZEROTAGS_BIT,
#ifdef CONFIG_KASAN_HW_TAGS
	___GFP_SKIP_ZERO_BIT,
	___GFP_SKIP_KASAN_BIT,
#endif
#ifdef CONFIG_LOCKDEP
	___GFP_NOLOCKDEP_BIT,
#endif
#ifdef CONFIG_SLAB_OBJ_EXT
	___GFP_NO_OBJ_EXT_BIT,
#endif
	___GFP_LAST_BIT
};
</pre>
<p>
所有这些gfp_t类型的值，有些是zone修饰符，有些是内存分配行为，比如___GFP_DIRECT_RECLAIM_BIT允许触发直接内存回收，后面的内存管理分析的系列文章还会遇到这些标志，再在具体的代码上下文分析更为形象。
</p>

<p>
继续分析gfp_zone函数：
</p>
<pre class="example" id="org09ecb76">
z = (GFP_ZONE_TABLE &gt;&gt; (bit * GFP_ZONES_SHIFT)) &amp;
				 ((1 &lt;&lt; GFP_ZONES_SHIFT) - 1);
</pre>
<p>
将GFP_ZONE_TABLE右移bit * GFP_ZONES_SHIFT，这正是前面定义GFP_ZONE_TABLE时，存放在bit这种标志组合索引处的zone序号，它用来优先为bit这种gfp标志组合分配内存，注意是以2个比特为一个条目，所以最后做与运算，相当于只取最后两位。
</p>

<p>
回到policy_nodemask函数的第三种MPOL_BIND的情况，apply_policy_zone是说要将内存策略应用在较高点的区域，这个条件是本case下设置nodemask的必要条件，另一个必要条件是内存策略的pol-&gt;nodes要和当前进程允许的节点mask有交集（也就是task_struct:mems_allowed）。当然MPOL_BIND下也要将内存策略设置的优先node号带出并返回。
</p>

<p>
<b>第四种case MPOL_INTERLEAVE：</b><br>
根据前面的分析，这种情况就是内存分配在一组节点内交错循环分配：
</p>
<pre class="example" id="orgd337d3d">
case MPOL_INTERLEAVE:
	/* Override input node id */
	*nid = (ilx == NO_INTERLEAVE_INDEX) ?
		interleave_nodes(pol) : interleave_nid(pol, ilx);
	break;
</pre>
<p>
可以看到，分两种情况选择使用不同的函数来获得内存分配的优先节点，NO_INTERLEAVE_INDEX主要指示了要不要使用task_struct:il_prev来作为索引选择内存分配的节点，如果使用task_struct:il_prev（也就是ilx参数为-1）则通过interleave_nodes函数来获得内存分配的节点：
</p>
<pre class="example" id="orgcc022b3">
static unsigned int interleave_nodes(struct mempolicy *policy)
{
	unsigned int nid;
	unsigned int cpuset_mems_cookie;

	/* to prevent miscount, use tsk-&gt;mems_allowed_seq to detect rebind */
	do {
		cpuset_mems_cookie = read_mems_allowed_begin();
		nid = next_node_in(current-&gt;il_prev, policy-&gt;nodes);
	} while (read_mems_allowed_retry(cpuset_mems_cookie));

	if (nid &lt; MAX_NUMNODES)
		current-&gt;il_prev = nid;
	return nid;
}
</pre>
<p>
do-while循环主要是处理并发情况，此处不讨论了。该函数主要使用next_node_in来获得合适的节点号，也就是在pol-&gt;nodes中找到第一个置位的bit的序号，并且是在current-&gt;il_prev之后，返回的nid小于MAX_NUMNODES时才会给出nid给调用者。
</p>

<p>
这里需要简单看下next_node_in的实现，该函数主要是要处理一种临界情况，那就是返回的node id的序号等于MAX_NUMNODES，就又要回到参数srcp的第一个置位的bit的序号：
</p>
<pre class="example" id="org7625946">
#define next_node_in(n, src) __next_node_in((n), &amp;(src))
static __always_inline unsigned int __next_node_in(int node, const nodemask_t *srcp)
{
	unsigned int ret = __next_node(node, srcp);

	if (ret == MAX_NUMNODES)
		ret = __first_node(srcp);
	return ret;
}
</pre>
<p>
如果不使用task_struct:il_prev，就会调用interleave_nid来获得内存分配的节点号：
</p>
<pre class="example" id="org9b67aa9">
static unsigned int interleave_nid(struct mempolicy *pol, pgoff_t ilx)
{
	nodemask_t nodemask;
	unsigned int target, nnodes;
	int i;
	int nid;

	nnodes = read_once_policy_nodemask(pol, &amp;nodemask);
	if (!nnodes)
		return numa_node_id();
	target = ilx % nnodes;
	nid = first_node(nodemask);
	for (i = 0; i &lt; target; i++)
		nid = next_node(nid, nodemask);
	return nid;
}
</pre>
<p>
该函数以传入的ilx作为索引来选择内存分配的节点，首先ilx需要对pol-&gt;nodes里置位的节点数目进行取模得到target，然后通过first_node获得nodemask里第一个置位的节点号nid，最后从nid开始循环target次，找到低target个置位的比特的序号，返回。
</p>


<p>
<b>第五种case MPOL_WEIGHTED_INTERLEAVE：</b> <br>
该种情况与case 4类似：
</p>
<pre class="example" id="org1e82bf3">
case MPOL_WEIGHTED_INTERLEAVE:
	*nid = (ilx == NO_INTERLEAVE_INDEX) ?
		weighted_interleave_nodes(pol) :
		weighted_interleave_nid(pol, ilx);
	break;
</pre>
<p>
依据ilx参数的不同，而调用不同的函数确定nid并返回。当使用task_struct:il_prev时（也就是ilx无效为-1）调用weighted_interleave_nodes来确定分配内存的节点号，当ilx有效时，就会调用weighted_interleave_nid使用ilx来确定，下面依次分析。
</p>

<p>
首先是weighted_interleave_nodes函数：
</p>
<pre class="example" id="org79e0e7d">
static unsigned int weighted_interleave_nodes(struct mempolicy *policy)
{
	unsigned int node;
	unsigned int cpuset_mems_cookie;

retry:
	/* to prevent miscount use tsk-&gt;mems_allowed_seq to detect rebind */
	cpuset_mems_cookie = read_mems_allowed_begin();
	node = current-&gt;il_prev;
	if (!current-&gt;il_weight || !node_isset(node, policy-&gt;nodes)) {
		node = next_node_in(node, policy-&gt;nodes);
		if (read_mems_allowed_retry(cpuset_mems_cookie))
			goto retry;
		if (node == MAX_NUMNODES)
			return node;
		current-&gt;il_prev = node;
		current-&gt;il_weight = get_il_weight(node);
	}
	current-&gt;il_weight--;
	return node;
}
</pre>

<p>
先抛开if条件里的逻辑不谈，每次进入weighted_interleave_nodes函数，就会返回current这个task_struct结构体里的il_prev，它就是记录了当前用于内存分配的节点号，每分配一次，current-&gt;il_weight就会递减，这相当于在il_prev这个内存节点上做了权重，分配il_weight次后就会将这个权重递减为1了。
</p>

<p>
现在分析if里的逻辑，进入这个if的条件是il_weight递减到0，或者前次使用的内存节点已经不在policy里允许的nodes时。
</p>

<p>
if里的逻辑主要是更新下一个使用的节点，由next_node_in获得，同时current:il_weight也要更新为当前这个节点的权重，这可以通过get_il_weight去获得：
</p>
<pre class="example" id="orgdde1058">
static u8 get_il_weight(int node)
{
	u8 *table;
	u8 weight;

	rcu_read_lock();
	table = rcu_dereference(iw_table);
	/* if no iw_table, use system default */
	weight = table ? table[node] : 1;
	/* if value in iw_table is 0, use system default */
	weight = weight ? weight : 1;
	rcu_read_unlock();
	return weight;
}
</pre>
<p>
从这个函数可以知道weight其实就是来自iw_table里对应节点的权重，它事先通过node_store函数去存放。总结来说，这个函数的功能就是达到前面介绍interleave分配的效果：在一组节点中交错分配内存，并且会按照一定的权重来分配，比如这里体现这点的就是每次进这个函数都会将current-&gt;il_weight权重递减，为非零本次分配内存的节点号不会改变，而当这个值递减为0，就会改变分配内存的节点号。
</p>

<p>
当ilx有效时，是weighted_interleave_nid函数用来确定分配内存的节点：
</p>
<pre class="example" id="orgcb4e129">
static unsigned int weighted_interleave_nid(struct mempolicy *pol, pgoff_t ilx)
{
	nodemask_t nodemask;
	unsigned int target, nr_nodes;
	u8 *table;
	unsigned int weight_total = 0;
	u8 weight;
	int nid;

	nr_nodes = read_once_policy_nodemask(pol, &amp;nodemask);
	if (!nr_nodes)
		return numa_node_id();

	rcu_read_lock();
	table = rcu_dereference(iw_table);
	/* calculate the total weight */
	for_each_node_mask(nid, nodemask) {
		/* detect system default usage */
		weight = table ? table[nid] : 1;
		weight = weight ? weight : 1;
		weight_total += weight;
	}

	/* Calculate the node offset based on totals */
	target = ilx % weight_total;
	nid = first_node(nodemask);
	while (target) {
		/* detect system default usage */
		weight = table ? table[nid] : 1;
		weight = weight ? weight : 1;
		if (target &lt; weight)
			break;
		target -= weight;
		nid = next_node_in(nid, nodemask);
	}
	rcu_read_unlock();
	return nid;
}
</pre>

<p>
该函数首先通过一个循环for_each_node_mask将pol-&gt;nodes里置上的节点的所有权重求和，然后ilx可以作为一个虚拟地址，其要对weight_total进行取余，这样ilx就会落在权重区间[0, weight_total]。
而后面的while循环实现了将余数target按权重落到相应的区间，其实现方式就是每次只要当前剩余target还不小于当前节点的权重，就会将当前target减去当前节点的权重。举个例子，系统有三个节点，权重依次为3，2，1那么中的权重为6，ilx作为虚拟地址比如可以为0-5，那么这六个地址按照比例一定是有3/6，2/6，1/6的概率分别在第一、二以及三个节点上完成内存分配请求，至于大于5的地址对weight_total取余数后一样符合这个加权概率。
</p>

<p>
最后这个policy_nodemask函数就是返回前面各个case算出的nodemask，注意nodemask是可以为NULL的，而nid通过最后一个参数带出：
</p>
<pre class="example" id="orgad437aa">
return nodemask;
</pre>

<p>
这样alloc_pages_mpol_noprof函数的第一部分policy_nodemask函数就介绍完了。
</p>
</div>
</div>
