kernel/mm/fast_alloc_page/fast_alloc_page.html


<div id="outline-container-orgf7fbc40" class="outline-3">
<h3 id="orgf7fbc40"><span class="section-number-3">2.2.</span> 第二部分</h3>
<div class="outline-text-3" id="text-2-2">
<p>
下面介绍alloc_pages_mpol_noprof函数的第二部分，本部分依据不同的情况而调用不同的分配函数。
</p>

<p>
<b>情形一MPOL_PREFERRED_MANY</b>
</p>

<p>
调用alloc_pages_preferred_many函数：
</p>
<pre class="example" id="org4bd4ceb">
if (pol-&gt;mode == MPOL_PREFERRED_MANY)
	return alloc_pages_preferred_many(gfp, order, nid, nodemask);
</pre>
<pre class="example" id="orgc56ad1e">
static struct page *alloc_pages_preferred_many(gfp_t gfp, unsigned int order,
						int nid, nodemask_t *nodemask)
{
	struct page *page;
	gfp_t preferred_gfp;

	/*
	 * This is a two pass approach. The first pass will only try the
	 * preferred nodes but skip the direct reclaim and allow the
	 * allocation to fail, while the second pass will try all the
	 * nodes in system.
	 */
	preferred_gfp = gfp | __GFP_NOWARN;
	preferred_gfp &amp;= ~(__GFP_DIRECT_RECLAIM | __GFP_NOFAIL);
	page = __alloc_pages_noprof(preferred_gfp, order, nid, nodemask);
	if (!page)
		page = __alloc_pages_noprof(gfp, order, nid, NULL);

	return page;
}
</pre>
<p>
可以看到该种情形通过alloc_pages_preferred_many实现两阶段的页面分配，第一阶段先尝试在nodemask中指定的节点中分配内存，并且不打印分配失败相关的一些信息，也不允许进入直接页面回收，
如果这种分配方式可以成功分配出页面，就返回页面了。否则就会以NULL参数作为nodemask再次调用__alloc_pages_noprof。所以这里可以看到对于指定在某些节点分配内存的方式，先是尽力在这些节点上分配，分配失败时还是会尝试整个系统的节点都可以分配，这是一种回退，尽量保证分配成功有内存可用的方式。
</p>

<p>
<b>情形二</b>
</p>

<p>
该情形实际是对大页内存分配的一个优化，即保证页面在一个指定的固定节点进行分配：
</p>
<pre class="example" id="org2d9d46b">
if (IS_ENABLED(CONFIG_TRANSPARENT_HUGEPAGE) &amp;&amp;
    /* filter "hugepage" allocation, unless from alloc_pages() */
    order == HPAGE_PMD_ORDER &amp;&amp; ilx != NO_INTERLEAVE_INDEX) {
	/*
	 * For hugepage allocation and non-interleave policy which
	 * allows the current node (or other explicitly preferred
	 * node) we only try to allocate from the current/preferred
	 * node and don't fall back to other nodes, as the cost of
	 * remote accesses would likely offset THP benefits.
	 *
	 * If the policy is interleave or does not allow the current
	 * node in its nodemask, we allocate the standard way.
	 */
	if (pol-&gt;mode != MPOL_INTERLEAVE &amp;&amp;
	    pol-&gt;mode != MPOL_WEIGHTED_INTERLEAVE &amp;&amp;
	    (!nodemask || node_isset(nid, *nodemask))) {
		/*
		 * First, try to allocate THP only on local node, but
		 * don't reclaim unnecessarily, just compact.
		 */
		page = __alloc_pages_node_noprof(nid,
			gfp | __GFP_THISNODE | __GFP_NORETRY, order);
		if (page || !(gfp &amp; __GFP_DIRECT_RECLAIM))
			return page;
		/*
		 * If hugepage allocations are configured to always
		 * synchronous compact or the vma has been madvised
		 * to prefer hugepage backing, retry allowing remote
		 * memory with both reclaim and compact as well.
		 */
	}
}
</pre>
<p>
首先判断是开启了透明大页并且分配的页面大小为2MB（笔者的环境amd64，HPAGE_PMD_ORDER = 21-12=
9，即分配2^9个页面，2MB大小的空间），而随后的条件ilx != NO_INTERLEAVE_INDEX、pol-&gt;mode !=
MPOL_INTERLEAVE以及pol-&gt;mode != MPOL_WEIGHTED_INTERLEAVE都是过滤掉交错分配的情况，因为交错
分配的本质要求就是要不固定节点分配，这和这个优化的要求：固定节点分配内存，是相矛盾的，最后
一个条件如果nodemask非空，就要求首选内存节点nid在这个nodemask中。这些条件任一不满足都会走
情形三的标准方式去分配内存。
</p>

<p>
__GFP_THISNODE指明内存分配应该在nid指明的节点上固定分配，调用者保证未来的内存访问来自nid的cpu，然后内存也是在nid节点分配的，这样本地内存访问的性能优势就得以体现。
</p>

<p>
<b>情形三</b>
</p>

<p>
该种情形其实没有太多分析的了，就是以前面算好的nodemask和nid，上层函数过来的gfp与order调用__alloc_pages_noprof函数即可：
</p>
<pre class="example" id="orgf0e35ac">
page = __alloc_pages_noprof(gfp, order, nid, nodemask);
</pre>
</div>
</div>
