kernel/mm/fast_alloc_page/fast_alloc_page.html


<div id="outline-container-org043ad81" class="outline-3">
<h3 id="org043ad81"><span class="section-number-3">2.3.</span> 第三部分</h3>
<div class="outline-text-3" id="text-2-3">
<p>
这部分代码主要是对numa页面的命中情况进行统计，分配出的页面如果确实和要求的nid一致，则增加zone:per_cpu_zonestats:vm_numa_event相应命中事件的计数：
</p>
<pre class="example" id="org490c70d">
if (unlikely(pol-&gt;mode == MPOL_INTERLEAVE) &amp;&amp; page) {
	/* skip NUMA_INTERLEAVE_HIT update if numa stats is disabled */
	if (static_branch_likely(&amp;vm_numa_stat_key) &amp;&amp;
	    page_to_nid(page) == nid) {
		preempt_disable();
		__count_numa_event(page_zone(page), NUMA_INTERLEAVE_HIT);
		preempt_enable();
	}
}
</pre>

<p>
注意这种更新只会对MPOL_INTERLEAVE策略有效，另外numa stat统计信息也是可以不使能的。下面看下__count_numa_event函数：
</p>
<pre class="example" id="org1958a9a">
static inline void
__count_numa_event(struct zone *zone, enum numa_stat_item item)
{
	struct per_cpu_zonestat __percpu *pzstats = zone-&gt;per_cpu_zonestats;

	raw_cpu_inc(pzstats-&gt;vm_numa_event[item]);
}
</pre>
<p>
可以清楚的看到，其就是增加了zone里percpu类型的变量per_cpu_zonestats的vm_numa_event数组里对应事件的计数。
</p>

<p>
这里需要分析下page_to_nid和page_zone这两个函数，这在现代常见的NUMA或SMP架构里是十分常见的。首先是page_to_nid，定义在mm.h里：
</p>
<pre class="example" id="orgab5965a">
#ifdef NODE_NOT_IN_PAGE_FLAGS
int page_to_nid(const struct page *page);
#else
static inline int page_to_nid(const struct page *page)
{
	return (PF_POISONED_CHECK(page)-&gt;flags &gt;&gt; NODES_PGSHIFT) &amp; NODES_MASK;
}
#endif
</pre>
<p>
可以看到依据NODE_NOT_IN_PAGE_FLAGS宏是否定义而分两种版本的实现，如果它定义了，page_to_nid函数实现在sparse.c文件中，就不实现后面的版本了。这个宏其实区分了node id是否要放置在page:flags成员中，因为这个成员其实就是个unsigned long，也就是64个比特位，有可能是没有足够空间来容纳node id的：
</p>
<pre class="example" id="org94286a2">
#if NODES_SHIFT != 0 &amp;&amp; NODES_WIDTH == 0
#define NODE_NOT_IN_PAGE_FLAGS	1
#endif
</pre>
<p>
要想NODE_NOT_IN_PAGE_FLAGS有定义，那么NODES_SHIFT要非0，而NODES_WIDTH为0：
</p>
<pre class="example" id="org8891ea8">
#ifdef CONFIG_NODES_SHIFT
#define NODES_SHIFT     CONFIG_NODES_SHIFT
#else
#define NODES_SHIFT     0
#endif
</pre>
<p>
现代NUMA架构里一般CONFIG_NODES_SHIFT都是有值的，比如为10或3，这在前面的<a href="#org195a12d">CONFIG_NODES_SHIFT</a>有介绍，也就是说第一个条件一般是满足的。
</p>

<p>
下面就是考虑NODES_WIDTH的值：
</p>
<pre class="example" id="orgbd6c4e0">
#if ZONES_WIDTH + LRU_GEN_WIDTH + SECTIONS_WIDTH + NODES_SHIFT \
	&lt;= BITS_PER_LONG - NR_PAGEFLAGS
#define NODES_WIDTH		NODES_SHIFT
#elif defined(CONFIG_SPARSEMEM_VMEMMAP)
#error "Vmemmap: No space for nodes field in page flags"
#else
#define NODES_WIDTH		0
#endif
</pre>

<p>
这里NR_PAGEFLAGS是用于表示页面状态（比如PG_locked、PG_dirty以及PG_uptodate等）占用多少比特位，这会在编译时确定，它其实就是__NR_PAGEFLAGS，在笔者的笔记本上它就是24。而在64位架构下BITS_PER_LONG一般就是64位。
</p>

<p>
ZONES_WIDTH定义如下：
</p>
<pre class="example" id="org9e7e463">
#if MAX_NR_ZONES &lt; 2
#define ZONES_SHIFT 0
#elif MAX_NR_ZONES &lt;= 2
#define ZONES_SHIFT 1
#elif MAX_NR_ZONES &lt;= 4
#define ZONES_SHIFT 2
#elif MAX_NR_ZONES &lt;= 8
#define ZONES_SHIFT 3
#else
#error ZONES_SHIFT "Too many zones configured"
#endif

#define ZONES_WIDTH		ZONES_SHIFT
</pre>
<p>
MAX_NR_ZONES其实就是<a href="#org14e5481">__MAX_NR_ZONES</a>，在笔者的环境它被定义为5，所以ZONES_SHIFT就是3，ZONES_WIDTH亦为3。LRU_GEN_WIDTH定义为3，LRU的一种优化实现会用到，参见内核文档multigen_lru.rst。
</p>

<p>
对于SECTIONS_WIDTH定义如下：
</p>
<pre class="example" id="org26e9676">
#if defined(CONFIG_SPARSEMEM) &amp;&amp; !defined(CONFIG_SPARSEMEM_VMEMMAP)
#define SECTIONS_WIDTH		SECTIONS_SHIFT
#else
#define SECTIONS_WIDTH		0
#endif
</pre>

<pre class="example" id="org12994d6">
#ifdef CONFIG_SPARSEMEM
#include &lt;asm/sparsemem.h&gt;
#define SECTIONS_SHIFT	(MAX_PHYSMEM_BITS - SECTION_SIZE_BITS)
#else
#define SECTIONS_SHIFT	0
#endif
</pre>
<p>
CONFIG_SPARSEMEM用于支持物理地址内存布局不连续或稀疏分布的系统，物理地址空间可能存在多个“空洞”（没有内存的区域），这样的系统包括NUMA系统（多节点非均匀内存访问），高端服务器或具有大地址空间的系统。将物理内存按大块划分为多个section（默认大小如128MB，具体取决于SECTION_SIZE_BITS）。每个section的元数据存储在struct mem_section中，用来描述该section的物理内存状态。如果某个section内有物理内存，则分配struct page元数据；否则不分配，节省内存。通过CONFIG_SPARSEMEM，内核能够按section大粒度来管理物理内存，而不是逐页操作，从而减少元数据开销。与稀疏内存模型相对的是平坦（FLATMEM）内存模型，适用于物理内存布局连续且紧凑的系统，例如嵌入式设备或简单的单处理器系统。内存布局是线性的，没有大的稀疏区域。
</p>

<p>
CONFIG_SPARSEMEM这种实现需要明确知道section的数量，而section的数量（SECTIONS_WIDTH占用多少比特位）由SECTIONS_SHIFT决定，依赖物理地址空间和section大小。因此，在这种模式下：SECTIONS_WIDTH = SECTIONS_SHIFT，用于指定section的数量以及在数据结构中进行索引的宽度。
</p>

<p>
而CONFIG_SPARSEMEM_VMEMMAP是CONFIG_SPARSEMEM的一种改进版本，优化了元数据的管理。使用VMEMMAP（虚拟内存映射来为每个物理页创建映射。每个页框的元数据直接存储在struct page中，而不
是依赖 struct mem_section。通过这种方式，不再需要SECTIONS_SHIFT，因为元数据已经按页粒度存储。vmemmap模式的核心特点是通过预先映射的虚拟地址直接访问struct page，而不是依赖struct
mem_section，struct page并不是直接按物理地址或其他逻辑地址存储，而是通过vmemmap映射到内核的虚拟地址空间，vmemmap通过虚拟地址空间为所有struct page提供了连续的地址映射，内核可以直接访问struct page而不会引发页面缺页异常（Page Fault），可以直接通过简单的偏移量计算找到对应的struct page。
</p>

<p>
现代系统一般都是既配置了CONFIG_SPARSEMEM，也配置了CONFIG_SPARSEMEM_VMEMMAP（比如笔者的环境），所以SECTIONS_WIDTH为0。
</p>

<p>
那么在笔者的环境下就是：(3 + 3 + 0 + 10 = 16) &lt;= (64 - 24 = 40)。也就是NODES_WIDTH有值为10，node id就在page:flags中。那么page_to_nid的实现就容易理解了，先将flags右移NODES_PGSHIFT位，这会保证node id所占的比特对齐到最低位，再与上NODES_MASK，只取node id所占的所有bit：
</p>
<pre class="example" id="orga41a7a1">
#define NODES_MASK		((1UL &lt;&lt; NODES_WIDTH) - 1)
#define NODES_PGSHIFT		(NODES_PGOFF * (NODES_WIDTH != 0))
#define SECTIONS_PGOFF		((sizeof(unsigned long)*8) - SECTIONS_WIDTH)
#define NODES_PGOFF		(SECTIONS_PGOFF - NODES_WIDTH)
</pre>
<p>
再用下图总结下page:flags的布局：
</p>
<pre class="example" id="orgcc6fa31">
| [SECTION] | [NODE] | ZONE | [LAST_CPUPID] | ... | FLAGS |
</pre>
<p>
可以看到，只有ZONE和FLAGS是必须的。并且从这个结构里也可以看出内存的一种层次架构，section里分多少node，节点里又分多少zone。
</p>

<p>
后面再来理解page_zone就简单了，它通过zone type返回当前节点对应的zone结构体：
</p>
<pre class="example" id="org3a75abe">
static inline struct zone *page_zone(const struct page *page)
{
	return &amp;NODE_DATA(page_to_nid(page))-&gt;node_zones[page_zonenum(page)];
}
</pre>
<p>
page_to_nid前面已经介绍了，page_zonenum的实现类似：
</p>
<pre class="example" id="org67b1f90">
static inline enum zone_type page_zonenum(const struct page *page)
{
	ASSERT_EXCLUSIVE_BITS(page-&gt;flags, ZONES_MASK &lt;&lt; ZONES_PGSHIFT);
	return (page-&gt;flags &gt;&gt; ZONES_PGSHIFT) &amp; ZONES_MASK;
}
</pre>

<p>
也是先将flags右移zone id所占的那些bit到最低位，然后和ZONES_MASK相与只取zone id所占的比特，另外pglist_data里node_zones成员表示这个节点所有的zone。注意这里有个ASSERT_EXCLUSIVE_BITS宏，它的主要作用是保证没有并发的写发生在(ZONES_MASK &lt;&lt; ZONES_PGSHIFT)里设置的比特位上，其具体实现原理可以参考kcsan-checks.h。
</p>

<p>
到这里终于分析完了alloc_pages_mpol_noprof函数的三个部分，后面继续分析alloc_pages_mpol_noprof函数调用的一个关键函数：__alloc_pages_noprof。
</p>
</div>
</div>
</div>

<div id="outline-container-org750f99c" class="outline-2">
<h2 id="org750f99c"><span class="section-number-2">3.</span> __alloc_pages_noprof</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>原型：</b>
</p>
<pre class="example" id="orgbbc17c1">
struct page *__alloc_pages_noprof(gfp_t gfp, unsigned int order,
				      int preferred_nid, nodemask_t *nodemask)
</pre>

<p>
<b>作用：</b>
</p>

<p>
分配2^order个页面，preferred_nid是首选节点，nodemask是备用的节点mask，可以从里面选择。
</p>

<p>
<b>详细分析：</b>
</p>

<p>
从这个函数开始就进入伙伴系统的代码（page_alloc.c）了，之前一直是在NUMA内存分配策略的实现上（mempolicy.c）。该函数也分为三个部分来分析：
</p>
<ul class="org-ul">
<li>第一部分是确定alloc_context结构体里成员的值。</li>
<li>第二部分是真正的分配页面部分，包括快速和慢速路径，本文主要关心快速路径。</li>
<li>第三部分是依据条件更新统计信息到mem cgroup中。</li>
</ul>

<p>
下面逐一分析。
</p>
</div>
