kernel/mm/fast_alloc_page/fast_alloc_page.html
<div id="outline-container-orgbaacee7" class="outline-3">
<h3 id="orgbaacee7"><span class="section-number-3">3.1.</span> 第一部分</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<a id="org08eaf14"></a>
首先介绍一个结构体alloc_context：
</p>
<pre class="example" id="orgcae67cd">
struct alloc_context {
	struct zonelist *zonelist;
	nodemask_t *nodemask;
	struct zoneref *preferred_zoneref;
	int migratetype;

	/*
	 * highest_zoneidx represents highest usable zone index of
	 * the allocation request. Due to the nature of the zone,
	 * memory on lower zone than the highest_zoneidx will be
	 * protected by lowmem_reserve[highest_zoneidx].
	 *
	 * highest_zoneidx is also used by reclaim/compaction to limit
	 * the target zone since higher zone than this index cannot be
	 * usable for this allocation request.
	 */
	enum zone_type highest_zoneidx;
	bool spread_dirty_pages;
};
</pre>
<p>
它用于保存一些在内核内存管理内部使用的分配参数。nodemask、migratetype以及highest_zoneidx在分配流程中一旦初始化就不会改变。zonelist、preferred_zone以及highest_zoneidx第一次在快速路径中设置后，可能在后面的慢速路径中发生改变，可能会回退到其它zone中分配。
</p>

<p>
这里着重解释下highest_zoneidx参数，它通过gfp_zone函数获得，为zone的编号，就是一个zone_type枚举类型值。每个zone里都有一个lowmem_reserve成员：
</p>
<pre class="example" id="orgeecc426">
long lowmem_reserve[MAX_NR_ZONES];
</pre>

<p>
另外由于highest_zoneidx也限制了内存分配最高可用的zone，那么在慢速路径中针对高于highest_zoneidx的zone就没有必要做回收或压缩了，因为即使回收/压缩出空闲内存了也会因为内存位于高于highest_zoneidx的zone而不会使用，这相当于是内存回收/压缩的一种优化。
</p>

<p>
第一部分主要就是确定alloc_context参数：
</p>
<pre class="example" id="orged50520">
struct page *page;
unsigned int alloc_flags = ALLOC_WMARK_LOW;
gfp_t alloc_gfp; /* The gfp_t that was actually used for allocation */
struct alloc_context ac = { };

/*
 * There are several places where we assume that the order value is sane
 * so bail out early if the request is out of bound.
 */
if (WARN_ON_ONCE_GFP(order &gt; MAX_PAGE_ORDER, gfp))
	return NULL;

gfp &amp;= gfp_allowed_mask;
/*
 * Apply scoped allocation constraints. This is mainly about GFP_NOFS
 * resp. GFP_NOIO which has to be inherited for all allocation requests
 * from a particular context which has been marked by
 * memalloc_no{fs,io}_{save,restore}. And PF_MEMALLOC_PIN which ensures
 * movable zones are not used during allocation.
 */
gfp = current_gfp_context(gfp);
alloc_gfp = gfp;
if (!prepare_alloc_pages(gfp, order, preferred_nid, nodemask, &amp;ac,
		&amp;alloc_gfp, &amp;alloc_flags))
	return NULL;

/*
 * Forbid the first pass from falling back to types that fragment
 * memory until all local zones are considered.
 */
alloc_flags |= alloc_flags_nofragment(zonelist_zone(ac.preferred_zoneref), gfp);
</pre>

<p>
ALLOC_WMARK_LOW代表内存的水位线之一，每个zone都有几种水位线，用于控制空闲内存在不同的水位时，在内存回收方面采取不同程度的措施：
</p>
<pre class="example" id="org1194951">
struct zone {
        /* Read-mostly fields */
 
        /* zone watermarks, access with *_wmark_pages(zone) macros */
        unsigned long _watermark[NR_WMARK];
        ...
};
enum zone_watermarks {
        WMARK_MIN,
        WMARK_LOW,
        WMARK_HIGH,
        WMARK_PROMO,
        NR_WMARK
};

/* The ALLOC_WMARK bits are used as an index to zone-&gt;watermark */
#define ALLOC_WMARK_MIN		WMARK_MIN
#define ALLOC_WMARK_LOW		WMARK_LOW
#define ALLOC_WMARK_HIGH	WMARK_HIGH
#define ALLOC_NO_WATERMARKS	0x04 /* don't check watermarks at all */
</pre>

<p>
ALLOC_WMARK_MIN对应的水位线是WMARK_MIN，这是最低的水位线，通常表示内存分配的最低安全阈值。当zone的可用页数低于此值时，分配内存需要特别严格的限制。如果内存低于这个水位线，系统可能会触发直接回收或触发OOM（Out-Of-Memory）杀手。保证系统维持最基本的内存可用性。通常用于高优先级的内存分配，避免耗尽内存。
</p>

<p>
ALLOC_WMARK_LOW对应的水位线是WMARK_LOW，是比ALLOC_WMARK_MIN高一点的阀值，用于防止内存过度分配导致系统进入紧急回收状态。如果zone的可用页数低于此水位线，但高于WMARK_MIN，后台内存回收机制（如kswapd）会被唤醒以补充内存。
</p>

<p>
ALLOC_WMARK_HIGH对应的水位线是 WMARK_HIGH，是最高的阈值。这是一个更宽松的水位线，当可用内存高于此值时，分配内存不需要触发任何回收机制。表示内存资源充足，分配可以直接进行。
</p>

<p>
ALLOC_NO_WATERMARKS不检查任何水位线。此标志用于绕过所有的水位线检查，通常在某些特殊情况下使用，比如高优先级的内存分配或紧急情况下的内存分配（如GFP_ATOMIC分配）。例如，在中断上下文或内存分配必须快速完成时。
</p>

<p>
alloc_gfp是在传进来的分配标志gfp的基础上在本次分配时还会添加一些标志，是实际用于内存分配的标志。
</p>

<p>
ac参数在<a href="#org08eaf14">alloc_context</a>介绍过了。
</p>

<p>
接下来的WARN_ON_ONCE_GFP是当order大于MAX_PAGE_ORDER时打印警告，单次分配的内存，不能做到物理上有大于2^MAX_PAGE_ORDER个页面连续，所以这里做了拦截。这里主要想稍微详细的展开WARN_ON_ONCE_GFP宏：
</p>

<pre class="example" id="org1d3c5fe">
#define WARN_ON_ONCE_GFP(cond, gfp)	({				\
	static bool __section(".data.once") __warned;			\
	int __ret_warn_once = !!(cond);					\
									\
	if (unlikely(!(gfp &amp; __GFP_NOWARN) &amp;&amp; __ret_warn_once &amp;&amp; !__warned)) { \
		__warned = true;					\
		WARN_ON(1);						\
	}								\
	unlikely(__ret_warn_once);					\
})
</pre>
<p>
可以看到，如果gfp里指定了__GFP_NOWARN，那么就不会打印警告，同时这里保证只打印一次的逻辑是在.data.once节里声明一个静态变量__warned，它初始为0，一旦满足条件通过WRAN_ON打印警告，同时全局静态变量__warned被改写为true，那么以后就再也不会打印警告了。
</p>

<p>
另外有一个相对通用的WARN_ON_ONCE实现。针对x86来说，一般配置了CONFIG_GENERIC_BUG、CONFIG_DEBUG_BUGVERBOSE以及宏__WARN_FLAGS，后者是个架构相关的宏，并且在绝大分架构上都有定义，它支持通过主动产生异常的方式，在异常句柄里去打印warning警告信息，对于x86架构来说就是ud2指令（否则就是warn_slowpath_fmt方式打印）：
</p>
<pre class="example" id="orgab296e8">
#define __WARN_FLAGS(flags)					\
do {								\
	__auto_type __flags = BUGFLAG_WARNING|(flags);		\
	instrumentation_begin();				\
	_BUG_FLAGS(ASM_UD2, __flags, ASM_REACHABLE);		\
	instrumentation_end();					\
} while (0)
</pre>
<p>
这样WARN_ON_ONCE就可以通过__WARN_FLAGS方式实现：
</p>
<pre class="example" id="orged17691">
#define WARN_ON_ONCE(condition) ({				\
	int __ret_warn_on = !!(condition);			\
	if (unlikely(__ret_warn_on))				\
		__WARN_FLAGS(BUGFLAG_ONCE |			\
			     BUGFLAG_TAINT(TAINT_WARN));	\
	unlikely(__ret_warn_on);				\
})
#endif
</pre>

<p>
可以看到这里传入了BUGFLAG_ONCE标志，__WARN_FLAGS的实现如下：
</p>
<pre class="example" id="org5c18f59">
#define __WARN_FLAGS(flags)					\
do {								\
	__auto_type __flags = BUGFLAG_WARNING|(flags);		\
	instrumentation_begin();				\
	_BUG_FLAGS(ASM_UD2, __flags, ASM_REACHABLE);		\
	instrumentation_end();					\
} while (0)
</pre>
<p>
_BUG_FLAGS宏的作用相当于是准备参数并通过ud2指令触发异常，这里就不贴代码了。最后异常的处理会来到__report_bug函数，里面有使用BUGFLAG_ONCE来保证只打印一次：
</p>
<pre class="example" id="org16571d4">
struct bug_entry *bug;
const char *file;
unsigned line, warning, once, done;

if (!is_valid_bugaddr(bugaddr))
	return BUG_TRAP_TYPE_NONE;

bug = find_bug(bugaddr);
if (!bug)
	return BUG_TRAP_TYPE_NONE;

disable_trace_on_warning();

bug_get_file_line(bug, &amp;file, &amp;line);

warning = (bug-&gt;flags &amp; BUGFLAG_WARNING) != 0;
once = (bug-&gt;flags &amp; BUGFLAG_ONCE) != 0;
done = (bug-&gt;flags &amp; BUGFLAG_DONE) != 0;

if (warning &amp;&amp; once) {
	if (done)
		return BUG_TRAP_TYPE_WARN;

	/*
	 * Since this is the only store, concurrency is not an issue.
	 */
	bug-&gt;flags |= BUGFLAG_DONE;
}
</pre>
<p>
可以看到，只要设置了BUGFLAG_ONCE和BUGFLAG_WARNING，就是要打印warning且只打印一次的话，就会将BUGFLAG_DONE标志置上给bug-&gt;flags。这个bug类型是bug_entry，它是从bug table里通过bugaddr作为索引找到的：
</p>
<pre class="example" id="orgd9b6d08">
struct bug_entry *find_bug(unsigned long bugaddr)
{
	struct bug_entry *bug;

	for (bug = __start___bug_table; bug &lt; __stop___bug_table; ++bug)
		if (bugaddr == bug_addr(bug))
			return bug;

	return module_find_bug(bugaddr);
}
</pre>
<p>
而bug_addr就是在_BUG_FLAGS宏里当作参数传入的，它一般就是WARN_ON_ONCE调用处。另外如果从内核的bug table里找不到，还可以从module的bug table里去找。
</p>

<p>
而一旦打印一次给bug-&gt;flags置上BUGFLAG_DONE后，下次再进入这个逻辑，就会满足if (done)的逻辑
直接返回而不进行后面真正的打印动作了。
</p>

<p>
这就是WARN_ON_ONCE实现只打印一次的方法，它主要是利用了bug_entry来保存打印情况，而WARN_ON_ONCE_GFP采取了另一个不同的办法来实现这种只打印一次的逻辑：在.data.section里声明一个静态变量__warned记录打印情况。
</p>

<p>
关于WARN/bug handle的更多细节实现，可以参考笔者其它文章。
</p>

<p>
回到__alloc_pages_noprof函数的第一部分继续看代码：
</p>
<pre class="example" id="org380265f">
gfp &amp;= gfp_allowed_mask;
/*
 * Apply scoped allocation constraints. This is mainly about GFP_NOFS
 * resp. GFP_NOIO which has to be inherited for all allocation requests
 * from a particular context which has been marked by
 * memalloc_no{fs,io}_{save,restore}. And PF_MEMALLOC_PIN which ensures
 * movable zones are not used during allocation.
 */
gfp = current_gfp_context(gfp);
alloc_gfp = gfp;
</pre>
<p>
这一部分对本次内存分配实际使用的gfp再次进行了一些调整并给到alloc_gfp。gfp_allowed_mask主要是用于解决启动早期不能使用一些gfp标志的问题，它初始定义如下：
</p>
<pre class="example" id="orgbf1d13e">
#define GFP_BOOT_MASK (__GFP_BITS_MASK &amp; ~(__GFP_RECLAIM|__GFP_IO|__GFP_FS))
gfp_t gfp_allowed_mask __read_mostly = GFP_BOOT_MASK;
</pre>
<p>
可以看到初始的时候，清除了这三个标志，意味着在启动阶段，这三个标志涉及到的功能内核还没有准备好，比如说磁盘IO或者文件操作还没有就绪。而在kernel_init_freeable函数里会解开这些限制：
</p>
<pre class="example" id="org003628d">
static noinline void __init kernel_init_freeable(void)
{
	/* Now the scheduler is fully set up and can do blocking allocations */
	gfp_allowed_mask = __GFP_BITS_MASK;
    ...
}
</pre>
<pre class="example" id="orgd2bb709">
#define __GFP_BITS_MASK ((__force gfp_t)((1 &lt;&lt; __GFP_BITS_SHIFT) - 1))
</pre>
<p>
__GFP_BITS_SHIFT就是最后一个gfp标志所占的比特，也就是所有gfp标志都可以使用了。
</p>

<p>
current_gfp_context主要是结合上Per-Process Flags，进程级别也可以设置gfp标志，存放于task_struct:flags域，比如进程可以设置PF_MEMALLOC_PIN标志，页面可以pin住，这时gfp flags需要清除__GFP_MOVABLE标志，也就是分配的页面是不能移动的了：
</p>
<pre class="example" id="org8ac1ea9">
static inline gfp_t current_gfp_context(gfp_t flags)
{
	unsigned int pflags = READ_ONCE(current-&gt;flags);

	if (unlikely(pflags &amp; (PF_MEMALLOC_NOIO | PF_MEMALLOC_NOFS | PF_MEMALLOC_PIN))) {
		/*
		 * NOIO implies both NOIO and NOFS and it is a weaker context
		 * so always make sure it makes precedence
		 */
		if (pflags &amp; PF_MEMALLOC_NOIO)
			flags &amp;= ~(__GFP_IO | __GFP_FS);
		else if (pflags &amp; PF_MEMALLOC_NOFS)
			flags &amp;= ~__GFP_FS;

		if (pflags &amp; PF_MEMALLOC_PIN)
			flags &amp;= ~__GFP_MOVABLE;
	}
	return flags;
}
</pre>
<p>
接下来继续分析prepare_alloc_pages函数，该函数最终敲定alloc_context参数，较为关键：
</p>
<pre class="example" id="org5c5dcfb">
static inline bool prepare_alloc_pages(gfp_t gfp_mask, unsigned int order,
		int preferred_nid, nodemask_t *nodemask,
		struct alloc_context *ac, gfp_t *alloc_gfp,
		unsigned int *alloc_flags)
{
	ac-&gt;highest_zoneidx = gfp_zone(gfp_mask);
	ac-&gt;zonelist = node_zonelist(preferred_nid, gfp_mask);
	ac-&gt;nodemask = nodemask;
	ac-&gt;migratetype = gfp_migratetype(gfp_mask);

	if (cpusets_enabled()) {
		*alloc_gfp |= __GFP_HARDWALL;
		/*
		 * When we are in the interrupt context, it is irrelevant
		 * to the current task context. It means that any node ok.
		 */
		if (in_task() &amp;&amp; !ac-&gt;nodemask)
			ac-&gt;nodemask = &amp;cpuset_current_mems_allowed;
		else
			*alloc_flags |= ALLOC_CPUSET;
	}

	might_alloc(gfp_mask);

	if (should_fail_alloc_page(gfp_mask, order))
		return false;

	*alloc_flags = gfp_to_alloc_flags_cma(gfp_mask, *alloc_flags);

	/* Dirty zone balancing only done in the fast path */
	ac-&gt;spread_dirty_pages = (gfp_mask &amp; __GFP_WRITE);

	/*
	 * The preferred zone is used for statistics but crucially it is
	 * also used as the starting point for the zonelist iterator. It
	 * may get reset for allocations that ignore memory policies.
	 */
	ac-&gt;preferred_zoneref = first_zones_zonelist(ac-&gt;zonelist,
					ac-&gt;highest_zoneidx, ac-&gt;nodemask);

	return true;
}
</pre>
<p>
第一行确定最高可以分配的zone_type（idx），通过gfp_zone得到，该函数（宏）在前面已经<a href="#org2f225cd">详细</a>介绍了。
第二行代码比较关键：
<a id="org1bfed18"></a>
</p>
<pre class="example" id="orge794793">
ac-&gt;zonelist = node_zonelist(preferred_nid, gfp_mask);
</pre>
<p>
这里就要引入内核内存管理的一个关键数据结构了：zonelist。在NUMA系统里每个内存节点由pglist_data数据结构表示，该结构体里有一个zonelist类型的数组成员名为node_zonelists：
</p>
<pre class="example" id="org0954bfe">
 typedef struct pglist_data {
     ...;
  	/*
	 * node_zonelists contains references to all zones in all nodes.
	 * Generally the first zones will be references to this node's
	 * node_zones.
	 */
    struct zonelist node_zonelists[MAX_ZONELISTS];
    ...
} pg_data_t;
</pre>
<p>
<a id="orgfcea928"></a>
</p>
<pre class="example" id="org0ac50b9">
/*
 * One allocation request operates on a zonelist. A zonelist
 * is a list of zones, the first one is the 'goal' of the
 * allocation, the other zones are fallback zones, in decreasing
 * priority.
 *
 * To speed the reading of the zonelist, the zonerefs contain the zone index
 * of the entry being read. Helper functions to access information given
 * a struct zoneref are
 *
 * zonelist_zone()	- Return the struct zone * for an entry in _zonerefs
 * zonelist_zone_idx()	- Return the index of the zone for an entry
 * zonelist_node_idx()	- Return the index of the node for an entry
 */
struct zonelist {
	struct zoneref _zonerefs[MAX_ZONES_PER_ZONELIST + 1];
};
</pre>
<pre class="example" id="org3125967">
/*
 * This struct contains information about a zone in a zonelist. It is stored
 * here to avoid dereferences into large structures and lookups of tables
 */
struct zoneref {
	struct zone *zone;	/* Pointer to actual zone */
	int zone_idx;		/* zone_idx(zoneref-&gt;zone) */
};
</pre>
<pre class="example" id="org6c5217f">
/* Maximum number of zones on a zonelist */
#define MAX_ZONES_PER_ZONELIST (MAX_NUMNODES * MAX_NR_ZONES)
</pre>
<p>
从上面这些代码就可以看出引入zonelist的缘由了，一个zonelist包含所有节点上的所有zone，一次分配就在一个zonelist上去操作（也就是所有的zone都是有可能去分配的）。zonelist里的zone按顺序依次向后具有较低的优先级用于分配内存，而排在最前面的zone就是最优先的zone要从里面分配内存。从MAX_ZONES_PER_ZONELIST宏的定义可以看出来所有内存其实就是按一种层次化组织，对于多节点的NUMA架构来说，就是分若干节点，每个节点又分若干zone。另外对于NUMA架构来说，node_zonelists成员实际分两条，一条是可以fallback的：ZONELIST_FALLBACK，也就是这里面有所有节点的所有zone，另外一条是：ZONELIST_NOFALLBACK，是内存分配标志gfp在指明了__GFP_THISNODE不允许回退时使用的zonelist，也就是只能从指定节点的zone里分配内存。
</p>

<p>
zoneref是具体存在一个zonelist里元素，它主要是加速访问zonelist，缓存下zone不用经常查阅zonelist这个表。
</p>

<p>
有了这些背景知识再来理解<a href="#org1bfed18">node_zonelist</a>的实现就简单了，gfp_zonelist主要是看gfp标志里是否设置了__GFP_THISNODE依据不同的情况返回是fallback还是nofallback的zonelist索引：
</p>
<pre class="example" id="org154f51b">
static inline int gfp_zonelist(gfp_t flags)
{
#ifdef CONFIG_NUMA
	if (unlikely(flags &amp; __GFP_THISNODE))
		return ZONELIST_NOFALLBACK;
#endif
	return ZONELIST_FALLBACK;
}
</pre>
<p>
返回的索引再加上node_zonelists就得到目标zonelist了，并存放到alloc_context的zonelist成员，后续会用来索引目标zone。
</p>

<p>
在继续分析prepare_alloc_pages的代码前，这里想简单的介绍下zonelist的初始化，详细的分析可以参见读者另外的文章。
</p>

<p>
对于多节点NUMA架构来说主要通过如下流程去初始化zonelist：
</p>
<pre class="example" id="org1cfbf1e">
__build_all_zonelists-&gt;build_zonelists-&gt;build_zonelists_in_node_order-&gt;build_zonerefs_node-&gt;zoneref_set_zone
</pre>

<p>
__build_all_zonelists里有如下代码循环针对所有的node去构建zonelist：
</p>
<pre class="example" id="org7a2ba47">
for_each_node(nid) {
	pg_data_t *pgdat = NODE_DATA(nid);
	build_zonelists(pgdat);
}
</pre>
<p>
build_zonelists里有关键代码如下：
</p>
<pre class="example" id="orgc1cbbd8">
while ((node = find_next_best_node(local_node, &amp;used_mask)) &gt;= 0) {
	/*
	 * We don't want to pressure a particular node.
	 * So adding penalty to the first node in same
	 * distance group to make it round-robin.
	 */
	if (node_distance(local_node, node) !=
	    node_distance(local_node, prev_node))
		node_load[node] += 1;

	node_order[nr_nodes++] = node;
	prev_node = node;
}

build_zonelists_in_node_order(pgdat, node_order, nr_nodes);
</pre>
<p>
就是说通过node_distance确定的节点间的距离，生成了一个node_order数组，这个数组里的元素是node的标号，数组里越靠后的元素表示的节点距离当前处理的节点越远，node_distance可以根据下层硬件的实际拓扑通过ACPI表传上来，这方面的细节参见笔者其它文章。node_order生成好了之后，它又作为参数调用了build_zonelists_in_node_order函数：
</p>
<pre class="example" id="orgd393c77">
/*
 * Build zonelists ordered by node and zones within node.
 * This results in maximum locality--normal zone overflows into local
 * DMA zone, if any--but risks exhausting DMA zone.
 */
static void build_zonelists_in_node_order(pg_data_t *pgdat, int *node_order,
		unsigned nr_nodes)
{
	struct zoneref *zonerefs;
	int i;

	zonerefs = pgdat-&gt;node_zonelists[ZONELIST_FALLBACK]._zonerefs;

	for (i = 0; i &lt; nr_nodes; i++) {
		int nr_zones;

		pg_data_t *node = NODE_DATA(node_order[i]);

		nr_zones = build_zonerefs_node(node, zonerefs);
		zonerefs += nr_zones;
	}
	zonerefs-&gt;zone = NULL;
	zonerefs-&gt;zone_idx = 0;
}
</pre>
<p>
从这个函数可以看出填充zonerefs的一个顺序：就是按照node_order里指明的节点依次取出node作为参数，调用build_zonerefs_node，这样自然的效果就是距离当前处理节点（需要填充当前节点的node_zonelists）越近的节点，其里面的zone(s)排在zoneref（zonelist：_zonerefs）数组元素的前面。有个小细节提下，最后一个zonerefs的zone为NULL，它会作为<a href="#org3040f42">first_zones_zonelist</a>函数没有找到符合条件的zone时的返回值。
</p>

<p>
这里再稍微详细看下build_zonerefs_node函数的实现：
</p>
<pre class="example" id="org4de5f00">
static int build_zonerefs_node(pg_data_t *pgdat, struct zoneref *zonerefs)
{
	struct zone *zone;
	enum zone_type zone_type = MAX_NR_ZONES;
	int nr_zones = 0;

	do {
		zone_type--;
		zone = pgdat-&gt;node_zones + zone_type;
		if (populated_zone(zone)) {
			zoneref_set_zone(zone, &amp;zonerefs[nr_zones++]);
			check_highest_zone(zone_type);
		}
	} while (zone_type);

	return nr_zones;
}
</pre>
<pre class="example" id="org3b28154">
static void zoneref_set_zone(struct zone *zone, struct zoneref *zoneref)
{
	zoneref-&gt;zone = zone;
	zoneref-&gt;zone_idx = zone_idx(zone);
}
</pre>
<pre class="example" id="orgef7fb51">
/*
 * zone_idx() returns 0 for the ZONE_DMA zone, 1 for the ZONE_NORMAL zone, etc.
 */
#define zone_idx(zone)		((zone) - (zone)-&gt;zone_pgdat-&gt;node_zones)
</pre>
<p>
<a id="org5dc9dcb"></a>
从zone_idx的实现知道，zone_type里的枚举类型也就是表示了zone的编号，比如ZONE_DMA的idx为0，ZONE_DMA32为1，依次类推。分析build_zonerefs_node函数的循环体可以知道，zonerefs数组里的元素，靠前的元素存放的zone其idx越大，因为zone_type的初始值为MAX_NR_ZONES，从较大的zone idx开始，针对某个具体的配置，这最终导致一个效果可能如下：
</p>
<pre class="example" id="org89d5cdc">
            zone_type    idx

zonerefs[0] ZONE_MOVABLE 3

zonerefs[1] ZONE_NORMAL  2

zonerefs[2] ZONE_DMA32   1

zonerefs[3] ZONE_DMA     0
</pre>
<p>
最后pgdat-&gt;node_zones成员表示了仅属于当前节点的所有zone，所以拿它作为基址偏移zone_type就可以得到相应zone_type的zone结构体了。
</p>

<p>
这里之所以需要详细理解这一点，因为<a href="#orgf1c3349">后面的</a>分配需要确定alloc_context: preferred_zoneref。
</p>

<p>
更多关于zone初始化的细节本文不再赘述了，参见笔者其它文章分析。
</p>

<p>
由上面初始化zonelist的简单分析也就可以更加深刻的理解<a href="#orgfcea928">前面代码</a>里对zonelist的注释了：
</p>
<pre class="example" id="orgd2cab88">
the first one is the 'goal' of the allocation, the other zones are fallback zones, in decreasing priority.
</pre>

<p>
回到prepare_alloc_pages继续分析，gfp_migratetype主要是用来从gfp标志中提取出页面的迁移类型，一种是可移动__GFP_MOVABLE，一种是可回收__GFP_RECLAIMABLE：
</p>
<pre class="example" id="org8872765">
/* Convert GFP flags to their corresponding migrate type */
#define GFP_MOVABLE_MASK (__GFP_RECLAIMABLE|__GFP_MOVABLE)
#define GFP_MOVABLE_SHIFT 3

static inline int gfp_migratetype(const gfp_t gfp_flags)
{
	VM_WARN_ON((gfp_flags &amp; GFP_MOVABLE_MASK) == GFP_MOVABLE_MASK);
	BUILD_BUG_ON((1UL &lt;&lt; GFP_MOVABLE_SHIFT) != ___GFP_MOVABLE);
	BUILD_BUG_ON((___GFP_MOVABLE &gt;&gt; GFP_MOVABLE_SHIFT) != MIGRATE_MOVABLE);
	BUILD_BUG_ON((___GFP_RECLAIMABLE &gt;&gt; GFP_MOVABLE_SHIFT) != MIGRATE_RECLAIMABLE);
	BUILD_BUG_ON(((___GFP_MOVABLE | ___GFP_RECLAIMABLE) &gt;&gt;
		      GFP_MOVABLE_SHIFT) != MIGRATE_HIGHATOMIC);

	if (unlikely(page_group_by_mobility_disabled))
		return MIGRATE_UNMOVABLE;

	/* Group based on mobility */
	return (__force unsigned long)(gfp_flags &amp; GFP_MOVABLE_MASK) &gt;&gt; GFP_MOVABLE_SHIFT;
}
#undef GFP_MOVABLE_MASK
#undef GFP_MOVABLE_SHIFT
</pre>
<p>
这个函数前面先进行了一些检查，比如第一行的检查代表__GFP_RECLAIMABLE和__GFP_MOVABLE不能同时被设置，其它行实际是检查在<a href="#org4f008de">这个</a>enum中，满足第3位是___GFP_MOVABLE_BIT，第四位是___GFP_RECLAIMABLE_BIT，从0开始计数。
</p>

<p>
<a id="org1e35c5c"></a>
接下来的代码主要是处理cpuset内存资源组的限制，这种限制主要针对进程上下文并且没有设置nodemask的时候，cpuset_current_mems_allowed在设置了CONFIG_CPUSETS后，就是当前进程（current）的mems_allowed成员限制的node。
</p>
<pre class="example" id="orgb99afbd">
if (cpusets_enabled()) {
	*alloc_gfp |= __GFP_HARDWALL;
	/*
	 * When we are in the interrupt context, it is irrelevant
	 * to the current task context. It means that any node ok.
	 */
	if (in_task() &amp;&amp; !ac-&gt;nodemask)
		ac-&gt;nodemask = &amp;cpuset_current_mems_allowed;
	else
		*alloc_flags |= ALLOC_CPUSET;
}
</pre>
<p>
在should_fail_alloc_page主要用于处理错误注入。
</p>

<p>
__GFP_WRITE代表内存的申请者将会写页面，这样内存分配的时候就会尽量将其分散在不同zone中：
<a id="org7a8ee49"></a>
</p>
<pre class="example" id="org951ddb6">
/* Dirty zone balancing only done in the fast path */
ac-&gt;spread_dirty_pages = (gfp_mask &amp; __GFP_WRITE);
</pre>

<p>
<a id="orgf1c3349"></a>
最后一行代码也是比较关键的：
</p>
<pre class="example" id="org39499d8">
/*
 * The preferred zone is used for statistics but crucially it is
 * also used as the starting point for the zonelist iterator. It
 * may get reset for allocations that ignore memory policies.
 */
ac-&gt;preferred_zoneref = first_zones_zonelist(ac-&gt;zonelist,
				ac-&gt;highest_zoneidx, ac-&gt;nodemask);
</pre>
<p>
<a id="org3040f42"></a>
通过first_zones_zonelist去获得目标zone，后面将使用这个目标zone去分配内存，ac-&gt;zonelist<a href="#org1bfed18">前面</a>分析过了如何得到。获得的目标zone其序号应当是小于或等于第二个参数ac-&gt;highest_zoneidx的，如果第三个参数ac-&gt;nodemask有值，还应当保证分出来的zone在ac-&gt;nodemask指明的节点里，下面是其实现：
</p>
<pre class="example" id="org5078b20">
/**
 * first_zones_zonelist - Returns the first zone at or below highest_zoneidx within the allowed nodemask in a zonelist
 * @zonelist: The zonelist to search for a suitable zone
 * @highest_zoneidx: The zone index of the highest zone to return
 * @nodes: An optional nodemask to filter the zonelist with
 *
 * This function returns the first zone at or below a given zone index that is
 * within the allowed nodemask. The zoneref returned is a cursor that can be
 * used to iterate the zonelist with next_zones_zonelist by advancing it by
 * one before calling.
 *
 * When no eligible zone is found, zoneref-&gt;zone is NULL (zoneref itself is
 * never NULL). This may happen either genuinely, or due to concurrent nodemask
 * update due to cpuset modification.
 *
 * Return: Zoneref pointer for the first suitable zone found
 */
static inline struct zoneref *first_zones_zonelist(struct zonelist *zonelist,
					enum zone_type highest_zoneidx,
					nodemask_t *nodes)
{
	return next_zones_zonelist(zonelist-&gt;_zonerefs,
							highest_zoneidx, nodes);
}
</pre>
<p>
<a id="org3cff6f3"></a>
</p>
<pre class="example" id="org58f239c">
/**
 * next_zones_zonelist - Returns the next zone at or below highest_zoneidx within the allowed nodemask using a cursor within a zonelist as a starting point
 * @z: The cursor used as a starting point for the search
 * @highest_zoneidx: The zone index of the highest zone to return
 * @nodes: An optional nodemask to filter the zonelist with
 *
 * This function returns the next zone at or below a given zone index that is
 * within the allowed nodemask using a cursor as the starting point for the
 * search. The zoneref returned is a cursor that represents the current zone
 * being examined. It should be advanced by one before calling
 * next_zones_zonelist again.
 *
 * Return: the next zone at or below highest_zoneidx within the allowed
 * nodemask using a cursor within a zonelist as a starting point
 */
static __always_inline struct zoneref *next_zones_zonelist(struct zoneref *z,
					enum zone_type highest_zoneidx,
					nodemask_t *nodes)
{
	if (likely(!nodes &amp;&amp; zonelist_zone_idx(z) &lt;= highest_zoneidx))
		return z;
	return __next_zones_zonelist(z, highest_zoneidx, nodes);
}
</pre>
<p>
可以看到一般最优可能的就是首选传进来的zone就满足条件了，也就是_zonerefs的第一个元素就满足条件，<a href="#org5dc9dcb">前面</a>有介绍过，_zonerefs中排在前面的zone具有较大的zoneidx，这里也可以看到这些具有较大zoneidx的zone优先用于分配内存。如果不满足条件通过__next_zones_zonelist继续获取目标zone。在first_zones_zonelist里使用_zonerefs作为迭代寻找合适zoneref的开始位置。这里也可以看到要想往前递进zone，其实就是下次传入第一个参数z往前自加一就行，继续看__next_zones_zonelist函数：
</p>
<pre class="example" id="org3a88c0e">
/* Returns the next zone at or below highest_zoneidx in a zonelist */
struct zoneref *__next_zones_zonelist(struct zoneref *z,
					enum zone_type highest_zoneidx,
					nodemask_t *nodes)
{
	/*
	 * Find the next suitable zone to use for the allocation.
	 * Only filter based on nodemask if it's set
	 */
	if (unlikely(nodes == NULL))
		while (zonelist_zone_idx(z) &gt; highest_zoneidx)
			z++;
	else
		while (zonelist_zone_idx(z) &gt; highest_zoneidx ||
				(zonelist_zone(z) &amp;&amp; !zref_in_nodemask(z, nodes)))
			z++;

	return z;
}
</pre>
<p>
在这里看到了z自增的语句，假如没有给定目标节点的限制，那么就只需要循环到zoneref:zone_idx小于或等于highest_zoneidx就行。如果限定了node，那么还需要满足zone:node指明的节点号在参数nodes中被设置才行。这里zonelist里的zoneref有所有节点的所有zone，循环里是可能都用到的一直寻找到一个满足条件的zone。
</p>

<p>
下面接续分析：
</p>
<pre class="example" id="org7b667ca">
/*
 * Forbid the first pass from falling back to types that fragment
 * memory until all local zones are considered.
 */
alloc_flags |= alloc_flags_nofragment(zonelist_zone(ac.preferred_zoneref), gfp);
</pre>

<p>
这段代码主要就是禁止在第一次分配时造成内存碎片，细节不赘述了，比较简单。
</p>

<p>
到目前为止__alloc_pages_noprof函数的第一部分就介绍完了，它主要是确定分配用的参数结构体alloc_context。
</p>
</div>
</div>
