kernel/mm/fast_alloc_page/fast_alloc_page.html
<div id="outline-container-org9fdbd85" class="outline-3">
<h3 id="org9fdbd85"><span class="section-number-3">3.2.</span> 第二部分</h3>
<div class="outline-text-3" id="text-3-2">
<p>
第二部分主要就是分配页面的动作，这主要分两个路径，一是快速路径通过get_page_from_freelist，二是慢速路径通过__alloc_pages_slowpath，本文主要介绍快速路径的流程，慢速路径参见作者其它文章。当快速路径不能分配页面时，就会走慢速路径了：
</p>
<pre class="example" id="org6b49d32">
/* First allocation attempt */
page = get_page_from_freelist(alloc_gfp, order, alloc_flags, &amp;ac);
if (likely(page))
	goto out;

alloc_gfp = gfp;
ac.spread_dirty_pages = false;

/*
 * Restore the original nodemask if it was potentially replaced with
 * &amp;cpuset_current_mems_allowed to optimize the fast-path attempt.
 */
ac.nodemask = nodemask;

page = __alloc_pages_slowpath(alloc_gfp, order, &amp;ac);
</pre>
<p>
可以看到当快速路径不能分配页面时，就会调整alloc_gfp，因为alloc_gfp在快速路径分配页面时可能施加了额外的限制，比如前面分析过的current_gfp_context里可能施加不能进行IO或文件系统相关的
操作，在<a href="#org1e35c5c">prepare_alloc_pages</a>里施加的__GFP_HARDWALL标志以严格遵循cpuset的策略，这些限制在慢速路径时都会解除，以提高内存分配的成功率。
</p>

<p>
另外spread_dirty_pages也是作为一种分散脏页面的限制在慢速路径也会解开。此外用于分配内存的ac-&gt;nodemask在<a href="#org1e35c5c">prepare_alloc_pages</a>里也可能因为cpuset内存组限制为cpuset_current_mems_allowed，在慢速路径时这种限制也没有了，用于分配内存的节点来自传进来的参数就可以了。
</p>

<p>
后面的<a href="#orgc8ff786">节</a>还会详细介绍快速路径的下一个核心函数get_page_from_freelist。
</p>
</div>
</div>
<div id="outline-container-org8c86059" class="outline-3">
<h3 id="org8c86059"><span class="section-number-3">3.3.</span> 第三部分</h3>
<div class="outline-text-3" id="text-3-3">
<p>
这一部分主要是做分配内存成功后的初始化或检测，比如不满足mem cgroup的限制时，还要通过__free_pages释放页面，详细细节之于本文主题就不介绍了。
</p>

<p>
<a id="orgc8ff786"></a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgfdc5cd3" class="outline-2">
<h2 id="orgfdc5cd3"><span class="section-number-2">4.</span> get_page_from_freelist</h2>
<div class="outline-text-2" id="text-4">
<p>
该函数会进一步进行快速页面的分配流程，也是分三个部分来分析这个函数。
</p>
<ul class="org-ul">
<li>第一部分是要从某个zone中分配内存前都需要进行的公共检测。</li>
<li>第二部分是检查水印并采取措施。</li>
<li>第三部分是进一步调用rmqueue函数去获取页面。</li>
</ul>
</div>
