kernel/mm/fast_alloc_page/fast_alloc_page.html
<div id="outline-container-orgab9e573" class="outline-3">
<h3 id="orgab9e573"><span class="section-number-3">4.1.</span> 第一部分</h3>
<div class="outline-text-3" id="text-4-1">
<p>
这里首先介绍一个宏循环，get_page_from_freelist函数的函数体基本都是在这个宏循环里完成，这个宏循环就是for_next_zone_zonelist_nodemask：
</p>
<pre class="example" id="orgc28b1fa">
#define for_next_zone_zonelist_nodemask(zone, z, highidx, nodemask) \
	for (zone = zonelist_zone(z);	                                \
		zone;							\
		z = next_zones_zonelist(++z, highidx, nodemask),	\
			zone = zonelist_zone(z))
</pre>
<p>
这个宏传入四个参数，其中第一个参数zone是zone类型的指针，它会随着循环的进行而更新，get_page_from_freelist主要的逻辑就可以使用这个更新了的zone，循环退出的条件也就是zone为NULL时。zone通过zonelist_zone获得：
</p>
<pre class="example" id="orgc5b44bb">
static inline struct zone *zonelist_zone(struct zoneref *zoneref)
{
	return zoneref-&gt;zone;
}
</pre>
<p>
<a href="#org3cff6f3">next_zones_zonelist</a>函数前面已经分析过了。继续往下分析第一部分的代码：
</p>
<pre class="example" id="org01759a4">
	struct zoneref *z;
	struct zone *zone;
	struct pglist_data *last_pgdat = NULL;
	bool last_pgdat_dirty_ok = false;
	bool no_fallback;

retry:
	/*
	 * Scan zonelist, looking for a zone with enough free.
	 * See also cpuset_node_allowed() comment in kernel/cgroup/cpuset.c.
	 */
	no_fallback = alloc_flags &amp; ALLOC_NOFRAGMENT;
	z = ac-&gt;preferred_zoneref;
	for_next_zone_zonelist_nodemask(zone, z, ac-&gt;highest_zoneidx,
					ac-&gt;nodemask) {
		struct page *page;
		unsigned long mark;

		if (cpusets_enabled() &amp;&amp;
			(alloc_flags &amp; ALLOC_CPUSET) &amp;&amp;
			!__cpuset_zone_allowed(zone, gfp_mask))
				continue;
</pre>
<pre class="example" id="org02b2afe">
static inline bool __cpuset_zone_allowed(struct zone *z, gfp_t gfp_mask)
{
	return cpuset_node_allowed(zone_to_nid(z), gfp_mask);
}
</pre>
<pre class="example" id="org650440c">
bool cpuset_node_allowed(int node, gfp_t gfp_mask)
{
	struct cpuset *cs;		/* current cpuset ancestors */
	bool allowed;			/* is allocation in zone z allowed? */
	unsigned long flags;

	if (in_interrupt())
		return true;
	if (node_isset(node, current-&gt;mems_allowed))
		return true;
	/*
	 * Allow tasks that have access to memory reserves because they have
	 * been OOM killed to get memory anywhere.
	 */
	if (unlikely(tsk_is_oom_victim(current)))
		return true;
	if (gfp_mask &amp; __GFP_HARDWALL)	/* If hardwall request, stop here */
		return false;

	if (current-&gt;flags &amp; PF_EXITING) /* Let dying task have memory */
		return true;

	/* Not hardwall and node outside mems_allowed: scan up cpusets */
	spin_lock_irqsave(&amp;callback_lock, flags);

	rcu_read_lock();
	cs = nearest_hardwall_ancestor(task_cs(current));
	allowed = node_isset(node, cs-&gt;mems_allowed);
	rcu_read_unlock();

	spin_unlock_irqrestore(&amp;callback_lock, flags);
	return allowed;
}
</pre>
<p>
首先通过zone_to_nid去获得zone所在的节点号：
</p>
<pre class="example" id="org0ed1003">
static inline int zone_to_nid(struct zone *zone)
{
	return zone-&gt;node;
}
</pre>
<p>
zone的node成员表示了zone所在的节点号，在初始化的时候通过zone_set_nid去设置：
</p>
<pre class="example" id="orgb343d64">
static inline void zone_set_nid(struct zone *zone, int nid)
{
	zone-&gt;node = nid;
}
</pre>
<p>
可以看到cpuset_node_allowed函数是这段代码的主体逻辑。通过in_terrupt判断出当前是在中断上下文的话返回true，代表任何节点分配内存都可以，中断上下文使用内存主要满足可用性，所以所有节点都可以。另外zone所在的节点在当前进程设置的mems_allowed节点里时也返回true，这是优先判断的。如果当前进程是oom选中的victim进程时，也返回true进行内存分配，因为victim进程很快会被杀死而释放出更多的内存。
</p>

<p>
再往后判断gfp标志是否设置了__GFP_HARDWALL，这个标志被设置，就要求内存必须来自current-&gt;mems_allowed，但是前面的node_isset并没有返回，那这说明不能满足__GFP_HARDWALL的语义了，返回false，表示不能在当前的内存节点（zone所在的结点）进行内存分配。再往后正在退出的进程的情况，也是返回true可以在当前zone分配内存，因为它退出了自然就有内存了。
</p>

<p>
最后的情况才是检查cpuset内存资源组的设置，关于cpuset参见笔者其它文章。这里只是简单提一下，引用cgroup sub sys时通过的id是通过##拼起来的，比如如下使用的cpuset_cgrp_id：
</p>
<pre class="example" id="orgad86ba5">
/* Retrieve the cpuset for a task */
static inline struct cpuset *task_cs(struct task_struct *task)
{
	return css_cs(task_css(task, cpuset_cgrp_id));
}
</pre>
<p>
其拼接代码如下位置定义：
</p>
<pre class="example" id="orgb8354f6">
./include/linux/cgroup-defs.h:42:#define SUBSYS(_x) _x ## _cgrp_id
</pre>

<p>
继续看get_page_from_freelist函数：
</p>
<pre class="example" id="org071d5c9">
if (ac-&gt;spread_dirty_pages) {
	if (last_pgdat != zone-&gt;zone_pgdat) {
		last_pgdat = zone-&gt;zone_pgdat;
		last_pgdat_dirty_ok = node_dirty_ok(zone-&gt;zone_pgdat);
	}

	if (!last_pgdat_dirty_ok)
		continue;
}
</pre>
<p>
这段代码主要针对分配的页面用于page cache即将写时，需要做写脏页平衡。实际上就是当gfp_mask设置了__GFP_WRITE时，ac-&gt;spread_dirty_pages就会<a href="#org7a8ee49">被设置</a>。这里的逻辑就是当循环遍历到zone所在的节点（zone-&gt;zone_pgdat）发生变化时，和前一个分配内存的节点不一样时，对于新的这个用于分配内存的节点（zone-&gt;zone_pgdat），需要调用node_dirty_ok判断其是否已经超过了脏页写数量的限制，那么往下分析下这个函数的实现：
</p>
<pre class="example" id="orgcba9df0">
/**
 * node_dirty_ok - tells whether a node is within its dirty limits
 * @pgdat: the node to check
 *
 * Return: %true when the dirty pages in @pgdat are within the node's
 * dirty limit, %false if the limit is exceeded.
 */
bool node_dirty_ok(struct pglist_data *pgdat)
{
	unsigned long limit = node_dirty_limit(pgdat);
	unsigned long nr_pages = 0;

	nr_pages += node_page_state(pgdat, NR_FILE_DIRTY);
	nr_pages += node_page_state(pgdat, NR_WRITEBACK);

	return nr_pages &lt;= limit;
}
</pre>
<p>
该函数先通过node_dirty_limit函数获得当前节点可以写的最大脏页数量limit，然后又通过node_page_state来获得脏页和回写页的数量nr_pages，当它小于limit证明还有页面可以用于写，返回true。
</p>

<p>
<a id="orgaca543a"></a>
继续分析下node_dirty_limit：
</p>
<pre class="example" id="org89fa554">
/**
 * node_dirty_limit - maximum number of dirty pages allowed in a node
 * @pgdat: the node
 *
 * Return: the maximum number of dirty pages allowed in a node, based
 * on the node's dirtyable memory.
 */
static unsigned long node_dirty_limit(struct pglist_data *pgdat)
{
	unsigned long node_memory = node_dirtyable_memory(pgdat);
	struct task_struct *tsk = current;
	unsigned long dirty;

	if (vm_dirty_bytes)
		dirty = DIV_ROUND_UP(vm_dirty_bytes, PAGE_SIZE) *
			node_memory / global_dirtyable_memory();
	else
		dirty = vm_dirty_ratio * node_memory / 100;

	if (rt_or_dl_task(tsk))
		dirty += dirty / 4;

	/*
	 * Dirty throttling logic assumes the limits in page units fit into
	 * 32-bits. This gives 16TB dirty limits max which is hopefully enough.
	 */
	return min_t(unsigned long, dirty, UINT_MAX);
}
</pre>
<p>
在Linux系统中，内存写操作先写入缓存页，稍后再由内核的写回机制将数据从内存写到磁盘。这些缓存页称为脏页（dirty pages）。为了避免内存中脏页过多影响系统性能，内核通过vm.dirty_bytes或vm.dirty_ratio参数来限制脏页的数量或比例。这两参数可以通过以下两个命令去查看：
</p>
<pre class="example" id="org18a1cd5">
sysctl vm.dirty_bytes
sysctl vm.dirty_ratio
</pre>
<p>
在node_dirty_limit函数中可以看到，如果设置了vm_dirty_bytes这种绝对值指明了可以多少内存用于脏页缓存，那么当前节点会按其所有的内存node_memory占整个可脏写内存的比例去分担vm_dirty_bytes。否则，就是当前节点可写内存的20%用于写脏页缓存。对于用rt_or_dl_task判断出来当前进程是实时或者deadline进程的话，还可以在算出来的可脏写大小的基础上再增加25%的容量。这里想继续简单分析下rt_or_dl_task，因为这方面涉及到进程优先级的划分：
</p>
<pre class="example" id="org0800440">
#define MAX_NICE	19
#define MIN_NICE	-20
#define NICE_WIDTH	(MAX_NICE - MIN_NICE + 1)

/*
 * Priority of a process goes from 0..MAX_PRIO-1, valid RT
 * priority is 0..MAX_RT_PRIO-1, and SCHED_NORMAL/SCHED_BATCH
 * tasks are in the range MAX_RT_PRIO..MAX_PRIO-1. Priority
 * values are inverted: lower p-&gt;prio value means higher priority.
 */

#define MAX_RT_PRIO		100
#define MAX_DL_PRIO		0

#define MAX_PRIO		(MAX_RT_PRIO + NICE_WIDTH)
#define DEFAULT_PRIO		(MAX_RT_PRIO + NICE_WIDTH / 2)

/*
 * Convert user-nice values [ -20 ... 0 ... 19 ]
 * to static priority [ MAX_RT_PRIO..MAX_PRIO-1 ],
 * and back.
 */
#define NICE_TO_PRIO(nice)	((nice) + DEFAULT_PRIO)
#define PRIO_TO_NICE(prio)	((prio) - DEFAULT_PRIO)

static inline bool rt_or_dl_prio(int prio)
{
	return unlikely(prio &lt; MAX_RT_PRIO);
}

/*
 * Returns true if a task has a priority that belongs to RT or DL classes.
 * PI-boosted tasks will return true. Use rt_or_dl_task_policy() to ignore
 * PI-boosted tasks.
 */
static inline bool rt_or_dl_task(struct task_struct *p)
{
	return rt_or_dl_prio(p-&gt;prio);
}
</pre>
<p>
从这一段代码可以看到，所有进程总的优先级可以从0到MAX_PRIO为140，默认的优先级DEFAULT_PRIO为120，并且优先级是倒转的，task_struct:prio的值越大，其优先级其实越小，task_struct:prio的值越小，其优先级越大。SCHED_NORMAL/SCHED_BATCH类的进程的优先级范围从100到139共四十个级别，这一般也就是用户态进程的级别，0-100是给实时或deadline类进程用的。对于SCHED_NORMAL/SCHED_BATCH的进程类来说，其还有nice值的概念，范围为[-20, 19]，它和优先级之间可以通过NICE_TO_PRIO/PRIO_TO_NICE这样的宏进行转换。
</p>

<p>
回到node_dirty_limit函数，往下分析下怎样获取一个节点的可脏内存给node_memory量：
</p>
<pre class="example" id="orgee622ea">
static unsigned long node_dirtyable_memory(struct pglist_data *pgdat)
{
	unsigned long nr_pages = 0;
	int z;

	for (z = 0; z &lt; MAX_NR_ZONES; z++) {
		struct zone *zone = pgdat-&gt;node_zones + z;

		if (!populated_zone(zone))
			continue;

		nr_pages += zone_page_state(zone, NR_FREE_PAGES);
	}

	/*
	 * Pages reserved for the kernel should not be considered
	 * dirtyable, to prevent a situation where reclaim has to
	 * clean pages in order to balance the zones.
	 */
	nr_pages -= min(nr_pages, pgdat-&gt;totalreserve_pages);

	nr_pages += node_page_state(pgdat, NR_INACTIVE_FILE);
	nr_pages += node_page_state(pgdat, NR_ACTIVE_FILE);

	return nr_pages;
}
</pre>
<p>
从这个node_dirtyable_memory函数的逻辑可以看到一个节点可以用于page cache的页面包括NR_FREE_PAGES空闲页面，以及NR_INACTIVE_FILE、NR_ACTIVE_FILE这种可以回收的页面，但是它们的和只是作为一个base value，<a href="#orgaca543a">node_dirty_limit</a>函数的逻辑前面介绍了还要进行比例计算，并且这个比例用户态是可配的。
</p>

<p>
base value还要减去保留的页面数量totalreserve_pages，
</p>

<p>
该函数依次遍历节点里所有的zone，对于已经populated了的zone，都需要加上里面空闲页面的数量。前面也有提到过，pglist_data:node_zones就是包含属于本节点的所有zone，所以遍历基地址从它开始。那么什么叫populated了的zone呢：
</p>
<pre class="example" id="org7a17baa">
/* Returns true if a zone has memory */
static inline bool populated_zone(struct zone *zone)
{
	return zone-&gt;present_pages;
}
</pre>
<p>
zone里有几个表示各种类型页面数量的变量：managed_pages、spanned_pages以及present_pages。一般来说spanned_pages &gt;= present_pages &gt;= managed_pages，spanned_pages是zone所跨过的所有页面，包括内存空洞：
</p>
<pre class="example" id="orgadb157d">
spanned_pages = zone_end_pfn - zone_start_pfn
</pre>
<p>
而present_pages是在spanned_pages中除去空洞的地址范围，managed_pages是在present_pages中由buddy system管理的页面。
</p>

<p>
<a id="org97aa203"></a>
再来看看zone_page_state函数：
</p>
<pre class="example" id="orgcc1eda7">
static inline unsigned long zone_page_state(struct zone *zone,
					enum zone_stat_item item)
{
	long x = atomic_long_read(&amp;zone-&gt;vm_stat[item]);
#ifdef CONFIG_SMP
	if (x &lt; 0)
		x = 0;
#endif
	return x;
}
</pre>
<p>
每个zone都有一个atomic_long_t类型的数组vm_stat，它的大小是NR_VM_ZONE_STAT_ITEMS，统计了zone里各种页面状态的数量，比如空闲页面数量放在vm_stat的第零位（NR_FREE_PAGES）。
</p>

<p>
回到node_dirty_limit函数再看看它调用的global_dirtyable_memory：
</p>
<pre class="example" id="orgb7c5f60">
/**
 * global_dirtyable_memory - number of globally dirtyable pages
 *
 * Return: the global number of pages potentially available for dirty
 * page cache.  This is the base value for the global dirty limits.
 */
static unsigned long global_dirtyable_memory(void)
{
	unsigned long x;

	x = global_zone_page_state(NR_FREE_PAGES);
	/*
	 * Pages reserved for the kernel should not be considered
	 * dirtyable, to prevent a situation where reclaim has to
	 * clean pages in order to balance the zones.
	 */
	x -= min(x, totalreserve_pages);

	x += global_node_page_state(NR_INACTIVE_FILE);
	x += global_node_page_state(NR_ACTIVE_FILE);

	if (!vm_highmem_is_dirtyable)
		x -= highmem_dirtyable_memory(x);

	return x + 1;	/* Ensure that we never return 0 */
}
</pre>
<p>
这个函数和node_dirtyable_memory的逻辑类似，只是global_node_page_state读的是vm_node_stat这个全局统计量。node_dirty_ok函数就介绍完了，回到get_page_from_freelist函数继续分析，如果node_dirty_ok返回false，意味着当前zone对应的node已经达到了最高的脏页限制，跳过到下一个zone继续。
</p>

<p>
继续往下分析get_page_from_freelist函数：
</p>
<pre class="example" id="orgc9f183b">
if (no_fallback &amp;&amp; nr_online_nodes &gt; 1 &amp;&amp;
    zone != zonelist_zone(ac-&gt;preferred_zoneref)) {
        int local_nid;

        /*
         * If moving to a remote node, retry but allow
         * fragmenting fallbacks. Locality is more important
         * than fragmentation avoidance.
         */
        local_nid = zonelist_node_idx(ac-&gt;preferred_zoneref);
        if (zone_to_nid(zone) != local_nid) {
                alloc_flags &amp;= ~ALLOC_NOFRAGMENT;
                goto retry;
        }
}
</pre>
<p>
这段代码的作用是，当前可能要切换节点分配内存了，但是还可以在清除ALLOC_NOFRAGMENT的情况下再尝试一次本地节点分配内存，因为本地性比碎片化更重要，本地性的内存访问性能较好。注意这里比较的基准是和preferred_zoneref这个zone所在的节点进行比较。goto retry实际上就是到整个for_next_zone_zonelist_nodemask循环重新开始一次了，只不过这次就没有ALLOC_NOFRAGMENT约束了。
</p>

<p>
再往下看第一部分的代码：
</p>
<pre class="example" id="orgf2aa964">
cond_accept_memory(zone, order);
</pre>
<p>
<a id="org49495fb"></a>
对于Intel TDX这样的虚拟化平台，在虚拟机能够使用内存前必须先accepted它，这种机制可以阻止恶意的主机修改虚拟机的内存：
</p>
<pre class="example" id="orge94e4bb">
static bool cond_accept_memory(struct zone *zone, unsigned int order)
{
	long to_accept;
	bool ret = false;

	if (!has_unaccepted_memory())
		return false;

	if (list_empty(&amp;zone-&gt;unaccepted_pages))
		return false;

	/* How much to accept to get to promo watermark? */
	to_accept = promo_wmark_pages(zone) -
		    (zone_page_state(zone, NR_FREE_PAGES) -
		    __zone_watermark_unusable_free(zone, order, 0) -
		    zone_page_state(zone, NR_UNACCEPTED));

	while (to_accept &gt; 0) {
		if (!try_to_accept_memory_one(zone))
			break;
		ret = true;
		to_accept -= MAX_ORDER_NR_PAGES;
	}

	return ret;
}
</pre>
<p>
该函数首先通过has_unaccepted_memory检测下是否还有unaccepted的内存，如果没有可以accepted的内存就直接返回false了。has_unaccepted_memory主要检测zone_with_unaccepted_pages这个量，它会在__free_unaccepted中增加，同时page:lru也会在这个函数中通过list_add_tail挂到zone:unaccepted_pages链表，以备后面可以accept这些内存。一旦accepted内存了，就可以在__accept_page中去减少zone_with_unaccepted_pages了。
</p>

<p>
如果有内存可以accept，则这些页面是挂在zone:unaccepted_pages链表上的，只有这个链表非空的时候才往下进行accepted内存的过程。
</p>

<p>
再往下的逻辑是计算需要accept多少内存可以达到promo watermark，首先计算promo watermark在哪个水位：
</p>
<pre class="example" id="orgd488b6c">
static inline unsigned long wmark_pages(const struct zone *z,
					enum zone_watermarks w)
{
	return z-&gt;_watermark[w] + z-&gt;watermark_boost;
}

static inline unsigned long promo_wmark_pages(const struct zone *z)
{
	return wmark_pages(z, WMARK_PROMO);
}
</pre>
<p>
可以看到这个promo watermark就是WMARK_PROMO水位再加上watermark_boot临时提高的水位。WMARK_PROMO是比较高的水位：
</p>
<pre class="example" id="org6c7e30a">
enum zone_watermarks {
	WMARK_MIN,
	WMARK_LOW,
	WMARK_HIGH,
	WMARK_PROMO,
	NR_WMARK
};
</pre>
<p>
WMARK_MIN水位最低。
</p>

<p>
计算还需要accept多少内存其实就是看现在的空闲内存离promo_wmark_pages算出的水印还差多少内存。但是通过zone_page_state得到的空闲内存还需要排除一些内存再来看离目标内存水印位多远，比如对于__zone_watermark_unusable_free函数：
<a id="org1ce8bbe"></a>
</p>
<pre class="example" id="orga9e456d">
static inline long __zone_watermark_unusable_free(struct zone *z,
				unsigned int order, unsigned int alloc_flags)
{
	long unusable_free = (1 &lt;&lt; order) - 1;

	/*
	 * If the caller does not have rights to reserves below the min
	 * watermark then subtract the free pages reserved for highatomic.
	 */
	if (likely(!(alloc_flags &amp; ALLOC_RESERVES)))
		unusable_free += READ_ONCE(z-&gt;nr_free_highatomic);

#ifdef CONFIG_CMA
	/* If allocation can't use CMA areas don't use free CMA pages */
	if (!(alloc_flags &amp; ALLOC_CMA))
		unusable_free += zone_page_state(z, NR_FREE_CMA_PAGES);
#endif

	return unusable_free;
}

</pre>
<p>
一开始的(1 &lt;&lt; order) - 1是处理对齐需要多少页面，然后要是调用者没有权限去分配预留的内存，那么不可用内存还需要加上nr_free_highatomic。允许分配预留内存（也就是允许分配低于WMARK_MIN水印的内存）的情况一共有四种：
</p>
<pre class="example" id="org6a50bc8">
/* Flags that allow allocations below the min watermark. */
#define ALLOC_RESERVES (ALLOC_NON_BLOCK|ALLOC_MIN_RESERVE|ALLOC_HIGHATOMIC|ALLOC_OOM)
</pre>
<p>
计算出了需要accepted内存的量to_accept就在循环里通过try_to_accept_memory_one去接受内存了，只要有一次接受成功都会返回true，每次接受内存的order都是最大order值。具体的try_to_accept_memory_one函数参见作者其它文章分析，概况的说这个过程最终会调用free_one_page释放页面到伙伴系统。
</p>

<p>
回到get_page_from_freelist的第一部分继续分析：
</p>
<pre class="example" id="orgfa1eb88">
/*
 * Detect whether the number of free pages is below high
 * watermark.  If so, we will decrease pcp-&gt;high and free
 * PCP pages in free path to reduce the possibility of
 * premature page reclaiming.  Detection is done here to
 * avoid to do that in hotter free path.
 */
if (test_bit(ZONE_BELOW_HIGH, &amp;zone-&gt;flags))
        goto check_alloc_wmark;

mark = high_wmark_pages(zone);
if (zone_watermark_fast(zone, order, mark,
                        ac-&gt;highest_zoneidx, alloc_flags,
                        gfp_mask))
        goto try_this_zone;
else
        set_bit(ZONE_BELOW_HIGH, &amp;zone-&gt;flags);
</pre>
<p>
这段代码主要是检查zone:flags是否设置了ZONE_BELOW_HIGH，这个水印表示zone的内存在高水位内存下。这时就需要进入check_alloc_wmark标签也就是第二部分进行内存回收了，通过high_wmark_pages去获得当前zone对应的高水位内存，注意这个都是要算上watermark_boost的：
<a id="orgfb6d417"></a>
</p>
<pre class="example" id="orged2396f">
static inline unsigned long wmark_pages(const struct zone *z,
					enum zone_watermarks w)
{
	return z-&gt;_watermark[w] + z-&gt;watermark_boost;
}
static inline unsigned long high_wmark_pages(const struct zone *z)
{
	return wmark_pages(z, WMARK_HIGH);
}
</pre>
<p>
zone:flags还可能有以下一些值：
</p>
<pre class="example" id="org4786e0f">
enum zone_flags {
	ZONE_BOOSTED_WATERMARK,		/* zone recently boosted watermarks.
					 * Cleared when kswapd is woken.
					 */
	ZONE_RECLAIM_ACTIVE,		/* kswapd may be scanning the zone. */
	ZONE_BELOW_HIGH,		/* zone is below high watermark. */
};
</pre>
<p>
对于当前zone里的空想内存是否能达到mark这个内存水位，通过zone_watermark_fast来计算，如果达到就直接进入第三部分try_this_zone进行内存分配了。否则要设置当前当前zone:flags的ZONE_BELOW_HIGH，并进入到check_alloc_wmark也就是第二部分代码去回收内存，回收到足够的内存就可以到try_this_zone继续内存分配了。否则就要跳过这个zone，下次再遇到这个zone，若zone:flags还设置为ZONE_BELOW_HIGH，那么还要继续走第二部分代码check_alloc_wmark去回收内存，直到在free_unref_page_commit中调用clear_bit去清除这个bit。
</p>

<p>
下面继续详细分析下zone_watermark_fast函数：
</p>
<pre class="example" id="orgf2429c3">
static inline bool zone_watermark_fast(struct zone *z, unsigned int order,
				unsigned long mark, int highest_zoneidx,
				unsigned int alloc_flags, gfp_t gfp_mask)
{
	long free_pages;

	free_pages = zone_page_state(z, NR_FREE_PAGES);

	/*
	 * Fast check for order-0 only. If this fails then the reserves
	 * need to be calculated.
	 */
	if (!order) {
		long usable_free;
		long reserved;

		usable_free = free_pages;
		reserved = __zone_watermark_unusable_free(z, 0, alloc_flags);

		/* reserved may over estimate high-atomic reserves. */
		usable_free -= min(usable_free, reserved);
		if (usable_free &gt; mark + z-&gt;lowmem_reserve[highest_zoneidx])
			return true;
	}

	if (__zone_watermark_ok(z, order, mark, highest_zoneidx, alloc_flags,
					free_pages))
		return true;

	/*
	 * Ignore watermark boosting for __GFP_HIGH order-0 allocations
	 * when checking the min watermark. The min watermark is the
	 * point where boosting is ignored so that kswapd is woken up
	 * when below the low watermark.
	 */
	if (unlikely(!order &amp;&amp; (alloc_flags &amp; ALLOC_MIN_RESERVE) &amp;&amp; z-&gt;watermark_boost
		&amp;&amp; ((alloc_flags &amp; ALLOC_WMARK_MASK) == WMARK_MIN))) {
		mark = z-&gt;_watermark[WMARK_MIN];
		return __zone_watermark_ok(z, order, mark, highest_zoneidx,
					alloc_flags, free_pages);
	}

	return false;
}
</pre>
<p>
zone_page_state<a href="#org97aa203">前面</a>已经介绍过了，就是获得zone里空闲的页面有多少。然后的逻辑是对order为0也就是只分配一个页面的情况进行特殊处理，这可以理解为一种优化。在 <code>if (!order)</code> 的逻辑里，首
先通过<a href="#org1ce8bbe">__zone_watermark_unusable_free</a>去获得不可用内存，然后现在剩余可用的内存free_pages里还要减去reserved，并且减去后需要大于当前传进来的水印与lowmem_reserve里保护内存的和，现在这个
水印前面介绍过就是WMARK_HIGH高水位。
</p>

<p>
如果order大于0，或者说order为0，但是没有返回true，都会进入到__zone_watermark_ok再次尝试：
</p>
<pre class="example" id="org67bb120">
bool __zone_watermark_ok(struct zone *z, unsigned int order, unsigned long mark,
			 int highest_zoneidx, unsigned int alloc_flags,
			 long free_pages)
{
	long min = mark;
	int o;

	/* free_pages may go negative - that's OK */
	free_pages -= __zone_watermark_unusable_free(z, order, alloc_flags);

	if (unlikely(alloc_flags &amp; ALLOC_RESERVES)) {
		/*
		 * __GFP_HIGH allows access to 50% of the min reserve as well
		 * as OOM.
		 */
		if (alloc_flags &amp; ALLOC_MIN_RESERVE) {
			min -= min / 2;

			/*
			 * Non-blocking allocations (e.g. GFP_ATOMIC) can
			 * access more reserves than just __GFP_HIGH. Other
			 * non-blocking allocations requests such as GFP_NOWAIT
			 * or (GFP_KERNEL &amp; ~__GFP_DIRECT_RECLAIM) do not get
			 * access to the min reserve.
			 */
			if (alloc_flags &amp; ALLOC_NON_BLOCK)
				min -= min / 4;
		}

		/*
		 * OOM victims can try even harder than the normal reserve
		 * users on the grounds that it's definitely going to be in
		 * the exit path shortly and free memory. Any allocation it
		 * makes during the free path will be small and short-lived.
		 */
		if (alloc_flags &amp; ALLOC_OOM)
			min -= min / 2;
	}

	/*
	 * Check watermarks for an order-0 allocation request. If these
	 * are not met, then a high-order request also cannot go ahead
	 * even if a suitable page happened to be free.
	 */
	if (free_pages &lt;= min + z-&gt;lowmem_reserve[highest_zoneidx])
		return false;

	/* If this is an order-0 request then the watermark is fine */
	if (!order)
		return true;

	/* For a high-order request, check at least one suitable page is free */
	for (o = order; o &lt; NR_PAGE_ORDERS; o++) {
		struct free_area *area = &amp;z-&gt;free_area[o];
		int mt;

		if (!area-&gt;nr_free)
			continue;

		for (mt = 0; mt &lt; MIGRATE_PCPTYPES; mt++) {
			if (!free_area_empty(area, mt))
				return true;
		}

#ifdef CONFIG_CMA
		if ((alloc_flags &amp; ALLOC_CMA) &amp;&amp;
		    !free_area_empty(area, MIGRATE_CMA)) {
			return true;
		}
#endif
		if ((alloc_flags &amp; (ALLOC_HIGHATOMIC|ALLOC_OOM)) &amp;&amp;
		    !free_area_empty(area, MIGRATE_HIGHATOMIC)) {
			return true;
		}
	}
	return false;
}
</pre>
<p>
该函数首先还是通过<a href="#org1ce8bbe">__zone_watermark_unusable_free</a>去获得不可用内存，free_pages要减去它。然后
<code>if (unlikely(alloc_flags &amp; ALLOC_RESERVES))</code> 里的逻辑主要是根据是否设置要使用保留内存标志来调整内存水线，如果可以使用保留内存，那么内存水线还可以往下调整，也就是可以使用更多的内存，不同的标志往下调的幅度不一样。
</p>

<p>
随后的代码：
</p>
<pre class="example" id="orgf9cbcc3">
if (free_pages &lt;= min + z-&gt;lowmem_reserve[highest_zoneidx])
	return false;

/* If this is an order-0 request then the watermark is fine */
if (!order)
	return true;
</pre>
<p>
这里其实再一次对order 0的情况进行里检测，前面的条件，其实就是除了高过水线和保留内存，还需要free_pages至少大1，因为order 0就是一个页面，前面的条件过了，并且后面的条件判断出是order0的情况就可以返回true了。
</p>

<p>
如果不是order 0的高阶内存分配的请求，后面的for循环里，从请求的order开始循环，依次向上到最大NR_PAGE_ORDERS这个order，这里面只要有一个order对应的free_area里有空闲的页面，就可以返回true了。
</p>

<p>
这里引出了free_area，需要介绍一点背景知识了。
</p>

<p>
Linux内核内存管理有2^order次方个连续页面形成页块大小这样的概念，一个单页面是内存分配的最小单位，而一个页块是连续的页面集合。NR_PAGE_ORDERS表示支持的页面块（page block）大小的种类，
NR_PAGE_ORDERS = MAX_ORDER，通常定义为11。这意味着支持从order-0到order-10的块大小（即2^0到2^10个页面，每个块里面的页面都是连续的）。zone结构体里有一free_area数组，每个元素表示一个特定order的空闲块。每个free_area[order]管理的页面块大小是2^order个页面，注意这并不是说管理的总页面就是2^order个，它只是说一个页面块的大小。
</p>

<p>
free_area也是一个结构体，里面的nr_free表示当前特定order的页块数量（不是单页面的数量），这表示了当前order里所有的页块个数。每个free_area[order]中有nr_free个页块，每个页块的大小是2^order个页面，所以当前order的free_area总共管理的页面数量可以通过以下公式计算：页面数量 = nr_free * 2^order。
</p>

<p>
在free_area中还有一个链表数组成员free_list，当前order对应的nr_free这么多个页块又根据内核定义的迁移类型（MIGRATE_TYPES）进一步分类，按不同的类型挂入free_list链表数组中。
</p>

<p>
有了这些基础再理解上面对于高阶内存分配的循环检测逻辑就容易理解了，free_area_empty函数就是根据传进来的free_area去检查对应参数migratetype的链表是否不为空，不为空则代表可以分出一个页块（其阶大于或等于请求的order），注意这里检测到了MIGRATE_PCPTYPES：
</p>
<pre class="example" id="orgc48ab24">
enum migratetype {
	MIGRATE_UNMOVABLE,
	MIGRATE_MOVABLE,
	MIGRATE_RECLAIMABLE,
	MIGRATE_PCPTYPES,	/* the number of types on the pcp lists */
	MIGRATE_HIGHATOMIC = MIGRATE_PCPTYPES,
#ifdef CONFIG_CMA
	/*
	 * MIGRATE_CMA migration type is designed to mimic the way
	 * ZONE_MOVABLE works.  Only movable pages can be allocated
	 * from MIGRATE_CMA pageblocks and page allocator never
	 * implicitly change migration type of MIGRATE_CMA pageblock.
	 *
	 * The way to use it is to change migratetype of a range of
	 * pageblocks to MIGRATE_CMA which can be done by
	 * __free_pageblock_cma() function.
	 */
	MIGRATE_CMA,
#endif
#ifdef CONFIG_MEMORY_ISOLATION
	MIGRATE_ISOLATE,	/* can't allocate from here */
#endif
	MIGRATE_TYPES
};
</pre>
<p>
也就是MIGRATE_UNMOVABLE、MIGRATE_MOVABLE以及MIGRATE_RECLAIMABLE三个链表只要有一个里面有空闲页块就行。
</p>

<p>
free_area_empty定义如下：
</p>
<pre class="example" id="org82b29f2">
static inline bool free_area_empty(struct free_area *area, int migratetype)
{
	return list_empty(&amp;area-&gt;free_list[migratetype]);
}
</pre>
<p>
可以看到其实现就是简单的判断链表非空。
</p>

<p>
回到zone_watermark_fast函数，最后的逻辑是针对order 0的情况并且ALLOC_MIN_RESERVE（__GFP_HIGH）高优先级内存分配，并且watermark_boost有值，且alloc_flags只是WMARK_MIN时，可以使用WMARK_MIN这个最低水位再次调用__zone_watermark_ok尝试去判断是否满足水位分配，相当于再次放宽了条件去检测。
</p>

<p>
回到get_page_from_freelist函数的第一部分，当zone_watermark_fast返回true时，表示当前内存充足，内存水位高于最高水位线，可以直接可以去往get_page_from_freelist函数的<a href="#org97aa6b6">第三部分</a>去分配内存了。否则就将zone-&gt;flags置上ZONE_BELOW_HIGH，表示当前zone的水位低于最高水位线，这样在释放页面的路径上就会减少pcp缓存的页面数量以达到最高水位线，另外需要进一步针对当前这次分配使用的水位做检测，去往get_page_from_freelist函数的<a href="#org7d0fd9f">第二部分</a>。
<a id="org7d0fd9f"></a>
</p>
</div>
</div>
