kernel/mm/fast_alloc_page/fast_alloc_page.org
** 第三部分
该部分本身的代码其实比较简单了，就是调用rmqueue去伙伴系统里拿内存，这个函数的分析又开到[[rmqueue][下一节]]去介绍了。

第三部分本身的代码如下：
#+begin_example
try_this_zone:
		page = rmqueue(zonelist_zone(ac->preferred_zoneref), zone, order,
				gfp_mask, alloc_flags, ac->migratetype);
		if (page) {
			prep_new_page(page, order, gfp_mask, alloc_flags);

			/*
			 * If this is a high-order atomic allocation then check
			 * if the pageblock should be reserved for the future
			 */
			if (unlikely(alloc_flags & ALLOC_HIGHATOMIC))
				reserve_highatomic_pageblock(page, order, zone);

			return page;
		} else {
			if (cond_accept_memory(zone, order))
				goto try_this_zone;

			/* Try again if zone has deferred pages */
			if (deferred_pages_enabled()) {
				if (_deferred_grow_zone(zone, order))
					goto try_this_zone;
			}
		}
	}

	/*
	 * It's possible on a UMA machine to get through all zones that are
	 * fragmented. If avoiding fragmentation, reset and try again.
	 */
	if (no_fallback) {
		alloc_flags &= ~ALLOC_NOFRAGMENT;
		goto retry;
	}

	return NULL;
}
#+end_example
rmqueue本节不介绍，假设rmqueue成功返回了page，那么prep_new_page会做一些准备工作：
#+begin_example
static void prep_new_page(struct page *page, unsigned int order, gfp_t gfp_flags,
							unsigned int alloc_flags)
{
	post_alloc_hook(page, order, gfp_flags);

	if (order && (gfp_flags & __GFP_COMP))
		prep_compound_page(page, order);

	/*
	 * page is set pfmemalloc when ALLOC_NO_WATERMARKS was necessary to
	 * allocate the page. The expectation is that the caller is taking
	 * steps that will free more memory. The caller should avoid the page
	 * being used for !PFMEMALLOC purposes.
	 */
	if (alloc_flags & ALLOC_NO_WATERMARKS)
		set_page_pfmemalloc(page);
	else
		clear_page_pfmemalloc(page);
}
#+end_example
先看post_alloc_hook函数：
#+begin_example
inline void post_alloc_hook(struct page *page, unsigned int order,
				gfp_t gfp_flags)
{
	bool init = !want_init_on_free() && want_init_on_alloc(gfp_flags) &&
			!should_skip_init(gfp_flags);
	bool zero_tags = init && (gfp_flags & __GFP_ZEROTAGS);
	int i;

	set_page_private(page, 0);
	set_page_refcounted(page);

	arch_alloc_page(page, order);
	debug_pagealloc_map_pages(page, 1 << order);

	/*
	 * Page unpoisoning must happen before memory initialization.
	 * Otherwise, the poison pattern will be overwritten for __GFP_ZERO
	 * allocations and the page unpoisoning code will complain.
	 */
	kernel_unpoison_pages(page, 1 << order);

	/*
	 * As memory initialization might be integrated into KASAN,
	 * KASAN unpoisoning and memory initializion code must be
	 * kept together to avoid discrepancies in behavior.
	 */

	/*
	 * If memory tags should be zeroed
	 * (which happens only when memory should be initialized as well).
	 */
	if (zero_tags) {
		/* Initialize both memory and memory tags. */
		for (i = 0; i != 1 << order; ++i)
			tag_clear_highpage(page + i);

		/* Take note that memory was initialized by the loop above. */
		init = false;
	}
	if (!should_skip_kasan_unpoison(gfp_flags) &&
	    kasan_unpoison_pages(page, order, init)) {
		/* Take note that memory was initialized by KASAN. */
		if (kasan_has_integrated_init())
			init = false;
	} else {
		/*
		 * If memory tags have not been set by KASAN, reset the page
		 * tags to ensure page_address() dereferencing does not fault.
		 */
		for (i = 0; i != 1 << order; ++i)
			page_kasan_tag_reset(page + i);
	}
	/* If memory is still not initialized, initialize it now. */
	if (init)
		kernel_init_pages(page, 1 << order);

	set_page_owner(page, order, gfp_flags);
	page_table_check_alloc(page, order);
	pgalloc_tag_add(page, current, 1 << order);
}
#+end_example
三个条件共同决定了是否要对分配出来的页面进行初始化：
#+begin_example
bool init = !want_init_on_free() && want_init_on_alloc(gfp_flags) &&
                !should_skip_init(gfp_flags);
#+end_example
#+begin_example
want_init_on_free实现如下：
static inline bool want_init_on_free(void)
{
	return static_branch_maybe(CONFIG_INIT_ON_FREE_DEFAULT_ON,
				   &init_on_free);
}
#+end_example
启用init_on_free后，内核会在释放内存时将所有页面分配器和slab分配器的内存清零。这相当于在内核启动参数中添加init_on_free=1，这时默认开启此功能。可以通过在启动参数中设置init_on_free=0来禁用该功能。与init_on_alloc（在分配时清零内存）类似，init_on_free的目的是防止未初始化的堆内存问题。当启用init_on_free时，释放的内存会立刻被清零。这有效防止了多种与未初始化内存相关的漏洞，例如：堆内容泄露：清零后，即使后续程序意外访问到释放的内存，也不会看到之前的内容。内存取证和冷启动攻击：攻击者即使尝试从释放的内存中恢复数据，也无法获取实际内容。启用init_on_free会对性能产生负面影响，主要原因是清零操作会触碰到本来已经“冷”的内存区域，影响缓存效率。性能损耗范围：大多数情况下，性能影响约为3-5%。在某些特定的合成工作负载（如专门测试内存分配和释放的基准测试）中，性能损耗可能高达8%。如果系统需要加强对内存数据的保护（如防止敏感数据泄露或提高系统安全性），可以启用init_on_free。对性能敏感的场景下，则可能需要权衡利弊，选择关闭此功能。在笔者的环境里这个功能是关闭的。

继续看下一个条件：
#+begin_example
DECLARE_STATIC_KEY_MAYBE(CONFIG_INIT_ON_ALLOC_DEFAULT_ON, init_on_alloc);

#define static_branch_maybe(config, x)					\
	(IS_ENABLED(config) ? static_branch_likely(x)			\
			    : static_branch_unlikely(x))

static inline bool want_init_on_alloc(gfp_t flags)
{
	if (static_branch_maybe(CONFIG_INIT_ON_ALLOC_DEFAULT_ON,
				&init_on_alloc))
		return true;
	return flags & __GFP_ZERO;
}
#+end_example
这个配置打开时，所有页面分配器出来的页面或是slab分配器得到的内存在分配的时候都会被清零，大多数时候该功能对性能的影响在1%，某些专门合成的测试负载可能会有高达7%的性能损失。

这个配置在笔者的环境是打开的。最后一个条件主要是针对arm64环境的硬件内存标签功能，它依赖于ARMv8.5+提供的Memory Tagging Extension，本文不详细探究，总之第三个条件一般也是true，所以在笔者的环境就是init为true。

再往下set_page_private将page: private成员给赋值成0，因为这个成员可能表示之前使用者有意义的值，比如buffer head可以使用它，也可以表示一个swap_entry_t，当该页面在伙伴系统里，又可以存放页面的order信息，所以在分配完成返回给用户前，先将这个值清0。

set_page_refcounted函数又设置page: _refcount为1。在设置前判断当前页面应该不是tail page，因为tail page不能单独拿出来分配，操作tail page只能通过head page，如果一个页面是tail page，那么page: compound_head的bit 0被设置为1。

再往下是unpoision页面。poision/unposion页面是内核内存管理的一个安全功能，在释放页面时，以特定的毒化模式串去填充页面，而在分配页面时又会去验证是不是这样的毒化模式串，这样如果内存页面被非法的访问修改过，就会在分配页面检测毒化模式串时被发现。这个配置CONFIG_PAGE_POISONING在笔者的环境上是打开的。

#+begin_example
kernel_unpoison_pages(page, 1 << order);

static inline void kernel_unpoison_pages(struct page *page, int numpages)
{
	if (page_poisoning_enabled_static())
		__kernel_unpoison_pages(page, numpages);
}

void __kernel_unpoison_pages(struct page *page, int n)
{
	int i;

	for (i = 0; i < n; i++)
		unpoison_page(page + i);
}

static void unpoison_page(struct page *page)
{
	void *addr;

	addr = kmap_local_page(page);
	kasan_disable_current();
	/*
	 * Page poisoning when enabled poisons each and every page
	 * that is freed to buddy. Thus no extra check is done to
	 * see if a page was poisoned.
	 */
	check_poison_mem(page, kasan_reset_tag(addr), PAGE_SIZE);
	kasan_enable_current();
	kunmap_local(addr);
}

static void check_poison_mem(struct page *page, unsigned char *mem, size_t bytes)
{
	static DEFINE_RATELIMIT_STATE(ratelimit, 5 * HZ, 10);
	unsigned char *start;
	unsigned char *end;

	start = memchr_inv(mem, PAGE_POISON, bytes);
	if (!start)
		return;

	for (end = mem + bytes - 1; end > start; end--) {
		if (*end != PAGE_POISON)
			break;
	}

	if (!__ratelimit(&ratelimit))
		return;
	else if (start == end && single_bit_flip(*start, PAGE_POISON))
		pr_err("pagealloc: single bit error\n");
	else
		pr_err("pagealloc: memory corruption\n");

	print_hex_dump(KERN_ERR, "", DUMP_PREFIX_ADDRESS, 16, 1, start,
			end - start + 1, 1);
	dump_stack();
	dump_page(page, "pagealloc: corrupted page details");
}
#+end_example
可以看到这里针对每个页面都调用了memchr_inv函数来检查其里的内容是不是毒化模式串PAGE_POISON，它一般是0xaa，memchr_inv的作用就是检查自start起始，如果某个地址不是0xaa，就返回这个串的地
址了，判断完所有内容都是0xaa的话，就返回NULL。

中间关于tag/kasan的处理本文不详细描述了。接下来主要想介绍下set_page_owner函数，尽管CONFIG_PAGE_OWNER在笔者的环境上没有打开，但这个功能是一个用于跟踪页面被哪个进程使用的，对于调试可能有很大帮助。

如果开启了CONFIG_PAGE_OWNER就会定义上page_owner_ops这个操作集。
#+begin_example
static struct page_ext_operations *page_ext_ops[] __initdata = {
#ifdef CONFIG_PAGE_OWNER
	&page_owner_ops,
#endif
...
};
#+end_example
page_owner_ops里的init成员为函数init_page_owner，它会调用：
#+begin_example
static_branch_enable(&page_owner_inited);
#+end_example
去使能page_owner_inited。而mm_core_init->page_ext_init->invoke_init_callbacks会对上述的init函数进行调用：
#+begin_example
static void __init invoke_init_callbacks(void)
{
	int i;
	int entries = ARRAY_SIZE(page_ext_ops);

	for (i = 0; i < entries; i++) {
		if (page_ext_ops[i]->init)
			page_ext_ops[i]->init();
	}
}
#+end_example
这样在打开了配置CONFIG_PAGE_OWNER时，page_owner_inited量就会使能。这样set_page_owner函数就可以调用__set_page_owner函数了：
#+begin_example
static inline void set_page_owner(struct page *page,
			unsigned short order, gfp_t gfp_mask)
{
	if (static_branch_unlikely(&page_owner_inited))
		__set_page_owner(page, order, gfp_mask);
}
#+end_example
如果开启了CONFIG_PAGE_OWNER，那么每个page关联到一个page_ext结构体，这个page_ext可以解释为一个地址，这样就可以在这个地址存储当前页面的一些额外的信息了，所谓extend就是这个意思。这个配置用于跟踪内核中每个页面的分配者和调用链。如果启用此特性，它会记录每个页面的分配和释放的调用堆栈，从而帮助开发者排查可能的内存泄漏或未释放的页面（例如裸调用 alloc_page(s) 而未释放）。

__set_page_owner函数里，通过page_ext_get->lookup_page_ext去获得当前页面对应的page_ext，所有的page_ext结构体在每个内存节点里有一个开始的基址base，就是pglist_data: node_page_ext成员，所谓获取page对应的page_ext，其实就是看当前页面对应当前节点起始页面的偏移是多少，取出相对于基址base偏移这么多的page_ext就行。而所有page所占的的page_ext结构体的空间，在alloc_node_page_ext函数里初始化的时候通过memblock_alloc_try_node去获得，并给到pglist_data: node_page_ext：
#+begin_example
static int __init alloc_node_page_ext(int nid)
{
	struct page_ext *base;
	unsigned long table_size;
	unsigned long nr_pages;

	nr_pages = NODE_DATA(nid)->node_spanned_pages;
	if (!nr_pages)
		return 0;

	/*
	 * Need extra space if node range is not aligned with
	 * MAX_ORDER_NR_PAGES. When page allocator's buddy algorithm
	 * checks buddy's status, range could be out of exact node range.
	 */
	if (!IS_ALIGNED(node_start_pfn(nid), MAX_ORDER_NR_PAGES) ||
		!IS_ALIGNED(node_end_pfn(nid), MAX_ORDER_NR_PAGES))
		nr_pages += MAX_ORDER_NR_PAGES;

	table_size = page_ext_size * nr_pages;

	base = memblock_alloc_try_nid(
			table_size, PAGE_SIZE, __pa(MAX_DMA_ADDRESS),
			MEMBLOCK_ALLOC_ACCESSIBLE, nid);
	if (!base)
		return -ENOMEM;
	NODE_DATA(nid)->node_page_ext = base;
	total_usage += table_size;
	memmap_boot_pages_add(DIV_ROUND_UP(table_size, PAGE_SIZE));
	return 0;
}
#+end_example
memblock是内核里相对于伙伴系统的另一个内存管理基址，它在伙伴系统还未就绪的时候使用，关于它的详细分析见笔者另外的文章，总之page_ext所需的空间是在启动时事先通过memblock预分配好的。

有了page_ext，就可以通过get_page_owner去获得page_owner结构体了，page_ext可能不止被page_owner使用，page owner是page_ext的使用者之一（page owner这个功能就作为page ext的client），__set_page_owner->__update_page_owner_handle，在后者这个函数里，先通过get_page_owner将page_ext转换为page_owner结构体，然后就可以往里面存信息了，由于每个页面关联一个page_ext，page_ext又可以关联到page_owner，所以最终其实就记录了每个页面由谁持有，且__set_page_owner->save_stack还保存了调用栈用于分析：
#+begin_example
noinline void __set_page_owner(struct page *page, unsigned short order,
					gfp_t gfp_mask)
{
	struct page_ext *page_ext;
	u64 ts_nsec = local_clock();
	depot_stack_handle_t handle;

	handle = save_stack(gfp_mask);

	page_ext = page_ext_get(page);
	if (unlikely(!page_ext))
		return;
	__update_page_owner_handle(page_ext, handle, order, gfp_mask, -1,
				   ts_nsec, current->pid, current->tgid,
				   current->comm);
	page_ext_put(page_ext);
	inc_stack_record_count(handle, gfp_mask, 1 << order);
}
#+end_example
#+begin_example
static inline void __update_page_owner_handle(struct page_ext *page_ext,
					      depot_stack_handle_t handle,
					      unsigned short order,
					      gfp_t gfp_mask,
					      short last_migrate_reason, u64 ts_nsec,
					      pid_t pid, pid_t tgid, char *comm)
{
	int i;
	struct page_owner *page_owner;

	for (i = 0; i < (1 << order); i++) {
		page_owner = get_page_owner(page_ext);
		page_owner->handle = handle;
		page_owner->order = order;
		page_owner->gfp_mask = gfp_mask;
		page_owner->last_migrate_reason = last_migrate_reason;
		page_owner->pid = pid;
		page_owner->tgid = tgid;
		page_owner->ts_nsec = ts_nsec;
		strscpy(page_owner->comm, comm,
			sizeof(page_owner->comm));
		__set_bit(PAGE_EXT_OWNER, &page_ext->flags);
		__set_bit(PAGE_EXT_OWNER_ALLOCATED, &page_ext->flags);
		page_ext = page_ext_next(page_ext);
	}
}
#+end_example
这里可以看到各种信息被保存到了page_owner，比较典型的比如调用者的pid。关于page owner和page ext的更多细节可以参考笔者其它文章。到这里post_alloc_hook就介绍的差不多了。回到prep_new_page函数：
#+begin_example
	if (order && (gfp_flags & __GFP_COMP))
		prep_compound_page(page, order);
#+end_example
如果gfp_flags设置了__GFP_COMP，那么就会调用prep_compound_page来处理head/tail page的逻辑。对于高阶的页面分配，可以组织这些连续的多个页面为复合页，高阶分配的第一页，称为head page，并设置了PG_head标志。除了head page以外的页称为tail pages，它们通过page->compound_head指向head page。第一个tail page的->compound_order字段记录了分配的阶数（order）。这意味着只有高阶分配（order > 0）的页才会被标记为compound page。tail page的compound_head的最低位（bit 0）表示PageTail() 状态（即是否是tail page），compound_head的其余部分存储了指向head page的指针。

高阶分配和compound page是有区别的，高阶多页分配是指分配2^order个连续的物理页（即高阶页）。分配高阶页时，是否启用compound page的逻辑，取决于分配时是否指定了__GFP_COMP标志。如果没有指定 __GFP_COMP，这些高阶页仅仅是分配了一块连续的物理内存，而没有特殊的结构或元数据（例如head/tail page）关联这些页。每个页只是独立的，和普通单页没有什么不同，内核无法识别它们属于同一个高阶分配。

#+begin_example
void prep_compound_page(struct page *page, unsigned int order)
{
	int i;
	int nr_pages = 1 << order;

	__SetPageHead(page);
	for (i = 1; i < nr_pages; i++)
		prep_compound_tail(page, i);

	prep_compound_head(page, order);
}
#+end_example
先通过__SetPageHead设置head页面的PG_head标志。然后就是一个for循环开始对后面所有的页设置page.compund_head：
#+begin_example
static __always_inline void set_compound_head(struct page *page, struct page *head)
{
	WRITE_ONCE(page->compound_head, (unsigned long)head + 1);
}
static inline void prep_compound_tail(struct page *head, int tail_idx)
{
	struct page *p = head + tail_idx;

	p->mapping = TAIL_MAPPING;
	set_compound_head(p, head);
	set_page_private(p, 0);
}
#+end_example
这里利用了指针对齐到struct page的大小，所以指向page结构体的指针最低位是没有用途的，用来存放信息可以判断该页是否是tail page。

继续往下看pre_new_page：
#+begin_example
	if (alloc_flags & ALLOC_NO_WATERMARKS)
		set_page_pfmemalloc(page);
	else
		clear_page_pfmemalloc(page);
#+end_example
ALLOC_NO_WATERMARKS标志的目的是在系统内存非常低的情况下，确保关键路径上的内存分配优先级和正确性。表示允许分配内存超出系统设定的正常水位线（watermark），即允许突破最低水位限制。这通常发生在内存非常紧张的情况下，用于确保关键任务（如内核操作或内存回收操作）的内存需求可以被满足。

PFMEMALLOC是一个与页面关联的标志，表示该页面是通过ALLOC_NO_WATERMARKS分配的。分配这样的页面通常预期会被用于释放更多内存（如内存回收操作），而不是普通用途。这段代码判断分配标志是否包含ALLOC_NO_WATERMARKS如果内存分配时指定了ALLOC_NO_WATERMARKS，意味着当前内存极度不足，调用者可能需要确保分配到的页面用于内存回收或类似的关键任务，调用set_page_pfmemalloc(page)，为页面设置PFMEMALLOC标志，否则调用clear_page_pfmemalloc(page)，清除该标志。

调用者有责任确保标记了PFMEMALLOC的页面不会被用于非关键任务。这样可以避免稀缺的内存资源被滥用，从而帮助系统恢复到正常状态。在内存回收时，当系统内存不足时，内核的回收机制可能需要更多内存来完成清理操作，这些PFMEMALLOC页面可以确保分配到的内存优先用于回收任务。

以下几个接口常用来操作页面的PFMEMALLOC标志：
#+begin_example
/*
 * Only to be called by the page allocator on a freshly allocated
 * page.
 */
static inline void set_page_pfmemalloc(struct page *page)
{
	page->lru.next = (void *)BIT(1);
}

static inline void clear_page_pfmemalloc(struct page *page)
{
	page->lru.next = NULL;
}

/*
 * Return true only if the page has been allocated with
 * ALLOC_NO_WATERMARKS and the low watermark was not
 * met implying that the system is under some pressure.
 */
static inline bool page_is_pfmemalloc(const struct page *page)
{
	/*
	 * lru.next has bit 1 set if the page is allocated from the
	 * pfmemalloc reserves.  Callers may simply overwrite it if
	 * they do not need to preserve that information.
	 */
	return (uintptr_t)page->lru.next & BIT(1);
}
#+end_example
可以看到其实际操作的是page:lru:next成员，而不是page:flags。这样prep_new_page函数就分析完了，又回到get_page_from_freelist函数：
#+begin_example
			/*
			 * If this is a high-order atomic allocation then check
			 * if the pageblock should be reserved for the future
			 */
			if (unlikely(alloc_flags & ALLOC_HIGHATOMIC))
				reserve_highatomic_pageblock(page, order, zone);
#+end_example
对于高阶原子分配（ALLOC_HIGHATOMIC），需要提前预留一些内存到MIGRATE_HIGHATOMIC类型，可以看到这种情况一般是unlikely，尽管如此还是需要详细分析下，因为这个函数涉及页面类型以及页面迁移的代码，以下是reserve_highatomic_pageblock实现：
#+begin_example
/*
 * Reserve the pageblock(s) surrounding an allocation request for
 * exclusive use of high-order atomic allocations if there are no
 * empty page blocks that contain a page with a suitable order
 */
static void reserve_highatomic_pageblock(struct page *page, int order,
					 struct zone *zone)
{
	int mt;
	unsigned long max_managed, flags;

	/*
	 * The number reserved as: minimum is 1 pageblock, maximum is
	 * roughly 1% of a zone. But if 1% of a zone falls below a
	 * pageblock size, then don't reserve any pageblocks.
	 * Check is race-prone but harmless.
	 */
	if ((zone_managed_pages(zone) / 100) < pageblock_nr_pages)
		return;
	max_managed = ALIGN((zone_managed_pages(zone) / 100), pageblock_nr_pages);
	if (zone->nr_reserved_highatomic >= max_managed)
		return;

	spin_lock_irqsave(&zone->lock, flags);

	/* Recheck the nr_reserved_highatomic limit under the lock */
	if (zone->nr_reserved_highatomic >= max_managed)
		goto out_unlock;

	/* Yoink! */
	mt = get_pageblock_migratetype(page);
	/* Only reserve normal pageblocks (i.e., they can merge with others) */
	if (!migratetype_is_mergeable(mt))
		goto out_unlock;

	if (order < pageblock_order) {
		if (move_freepages_block(zone, page, mt, MIGRATE_HIGHATOMIC) == -1)
			goto out_unlock;
		zone->nr_reserved_highatomic += pageblock_nr_pages;
	} else {
		change_pageblock_range(page, order, MIGRATE_HIGHATOMIC);
		zone->nr_reserved_highatomic += 1 << order;
	}

out_unlock:
	spin_unlock_irqrestore(&zone->lock, flags);
}
#+end_example
内核的内存管理，又将多个页面划分成了不同的迁移类型，比如MIGRATE_UNMOVABLE: 不可移动页面，MIGRATE_MOVABLE: 可移动页面（如用户空间页面），MIGRATE_RECLAIMABLE: 可回收页面（如文件缓存
页面），MIGRATE_HUGE: 巨页页面以及MIGRATE_CMA: 供连续内存分配器（CMA）使用的页面。通过将页面划分成不同的迁移类型，可以避免内存碎片化。具有相同迁移类型的页面组成在一起可以叫做一个pageblock（页块），这个pageblock具有pageblock_nr_pages个页面。一个页块具有阶pageblock_order，当然就有pageblock_nr_pages = 2^pageblock_order。

有了上面的背景再来分析reserve_highatomic_pageblock函数开头的判断，为high-order atomic分配保留的页面最多就是zone:managed_pages的百分之一。当百分之一的managed_pages还小于pageblock_nr_pages时，就不需要做预留页面了，因为最小也是预留一个pageblock。

在加锁前后都判断了zone->nr_reserved_highatomic >= max_managed，这种编程模式叫做double-checked locking，便于在条件满足时快速返回而不用获取锁。

继续往下看通过get_pageblock_migratetype获得了分配出来的page对应的迁移类型：
#+begin_example
#define get_pageblock_migratetype(page)					\
	get_pfnblock_flags_mask(page, page_to_pfn(page), MIGRATETYPE_MASK)
#+end_example
#+begin_example
/**
 * get_pfnblock_flags_mask - Return the requested group of flags for the pageblock_nr_pages block of pages
 * @page: The page within the block of interest
 * @pfn: The target page frame number
 * @mask: mask of bits that the caller is interested in
 *
 * Return: pageblock_bits flags
 */
unsigned long get_pfnblock_flags_mask(const struct page *page,
					unsigned long pfn, unsigned long mask)
{
	unsigned long *bitmap;
	unsigned long bitidx, word_bitidx;
	unsigned long word;

	bitmap = get_pageblock_bitmap(page, pfn);
	bitidx = pfn_to_bitidx(page, pfn);
	word_bitidx = bitidx / BITS_PER_LONG;
	bitidx &= (BITS_PER_LONG-1);
	/*
	 * This races, without locks, with set_pfnblock_flags_mask(). Ensure
	 * a consistent read of the memory array, so that results, even though
	 * racy, are not corrupted.
	 */
	word = READ_ONCE(bitmap[word_bitidx]);
	return (word >> bitidx) & mask;
}
#+end_example
这里首先介绍下page_to_pfn这个宏，现代的Linux系统一般都开启了CONFIG_SPARSEMEM_VMEMMAP配置，这个配置优化了page_to_pfn/pfn_to_page的计算效率，这个配置的介绍如下：
#+begin_example
SPARSEMEM_VMEMMAP uses a virtually mapped memmap to optimise pfn_to_page and page_to_pfn operations. This is the most efficient option when sufficient kernel resources are available.
#+end_example
开启这个配置时，page_to_pfn定义如下：
#+begin_example
#define __page_to_pfn(page)	(unsigned long)((page) - vmemmap)
#define page_to_pfn __page_to_pfn
#+end_example
从这个定义其实可以看到，vmemmap就存储了第一个page的虚拟地址，这点前面也有介绍过，但是vmemmap的设置没有介绍过，这里一并介绍下。对于x86架构来说，vmemmap的定义如下：
#+begin_example
#define vmemmap ((struct page *)VMEMMAP_START)
#+end_example
对于开启了DYNAMIC_MEMORY_LAYOUT配置的情况，VMEMMAP_START定义如下：
#+begin_example
# define VMEMMAP_START		vmemmap_base
#+end_example
配置DYNAMIC_MEMORY_LAYOUT主要使得像vmemmap这样的地址可以随机化增加安全性，以下是这个配置的介绍：
#+begin_example
This option makes base addresses of vmalloc and vmemmap as well as __PAGE_OFFSET movable during boot.
#+end_example
对于x86来说，vmemmap_base一般定义为如下：
#+begin_example
unsigned long vmemmap_base __ro_after_init = __VMEMMAP_BASE_L4;
EXPORT_SYMBOL(vmemmap_base);
#+end_example
这里可以看到，vmemmap_base使用了__ro_after_init修饰，它被如下定义：
#+begin_example
#define __ro_after_init __section(".data..ro_after_init")
#define __section(section) __attribute__((__section__(section)))
#+end_example
所以被__ro_after_init修饰的vmemmap_base最终就是放到了.data..ro_after_init这个节里，这是Linux内核划定的一个特殊的节，它的主要作用是在内核初始化完毕后，这个节里的数据不允许再更改，通过如下的调用路径设置了这个节的权限为只读：
#+begin_example
start_kernel(line: 1099)->rest_init(callback)->kernel_init->mark_readonly->mark_rodata_ro
#+end_example
上面的流程相对于vmemmap_base被设置的流程是靠后的，也就是说只有被随机化设置后，才能更改.data..ro_after_init为只读。Linux内核开始初始化时，vmemmap_base的初始值就是__VMEMMAP_BASE_L4。在初始化时，配置了DYNAMIC_MEMORY_LAYOUT还会对vmemmap_base进行随机化设置，下面简单分析下这个随机化的过程。首先vmemmap_base的地址给到了kaslr_memory_region的base成员：
#+begin_example
static __initdata struct kaslr_memory_region {
	unsigned long *base;
	unsigned long *end;
	unsigned long size_tb;
} kaslr_regions[] = {
	{
		.base	= &page_offset_base,
		.end	= &direct_map_physmem_end,
	},
	{
		.base	= &vmalloc_base,
	},
	{
		.base	= &vmemmap_base,
	},
};
#+end_example
这里base成员有地址的，在内核启动初始化流程里都会被随机化，其设置是在kernel_randomize_memory函数里：
#+begin_example
*kaslr_regions[i].base = vaddr;
#+end_example
该函数的调用按如下路径：
#+begin_example
start_kernel(line: 918)->setup_arch->kernel_randomize_memory
#+end_example
可见其随机化设置是早于只读设置的。
介绍完了page_to_pfn的细节，现在分析下MIGRATETYPE_MASK：
#+begin_example
#define PB_migratetype_bits 3
#define MIGRATETYPE_MASK ((1UL << PB_migratetype_bits) - 1)
#+end_example
就是描述页面迁移类型的共占3个bit，这里MIGRATETYPE_MASK是指只关心迁移类型的bit，其它bit不关心。迁移有哪些类型在[[enum-migratetype][migratetype枚举]]定义处介绍过。设置页面的迁移类型可以通过set_pageblock_migratetype接口。

介绍完了这些关联知识，可以看get_pfnblock_flags_mask的实现了。首先看get_pfnblock_flags_mask->get_pageblock_bitmap函数获得bitmap的实现：
#+begin_example
/* Return a pointer to the bitmap storing bits affecting a block of pages */
static inline unsigned long *get_pageblock_bitmap(const struct page *page,
							unsigned long pfn)
{
#ifdef CONFIG_SPARSEMEM
	return section_to_usemap(__pfn_to_section(pfn));
#else
	return page_zone(page)->pageblock_flags;
#endif /* CONFIG_SPARSEMEM */
}
#+end_example
该函数就是要获得一个bitmap，bitmap里存储了一些bit位，这些bit位可以影响整个page block范围。对于配置了CONFIG_SPARSEMEM的情况：首先使用__pfn_to_section来获得对应pfn页框号的mm_section
结构体：
#+begin_example
static inline struct mem_section *__pfn_to_section(unsigned long pfn)
{
	return __nr_to_section(pfn_to_section_nr(pfn));
}
#+end_example
pfn_to_section_nr是先要找到pfn对应的section number是多少：
#+begin_example
#define PFN_SECTION_SHIFT	(SECTION_SIZE_BITS - PAGE_SHIFT)
static inline unsigned long pfn_to_section_nr(unsigned long pfn)
{
	return pfn >> PFN_SECTION_SHIFT;
}
#+end_example
SECTION_SIZE_BITS在x86-64上一般就是27，也就是一个section就是128MB大，对pfn除以PFN_SECTION_SHIFT，相当于计算出这个pfn位于哪个section了，有了这个section number再通过__nr_to_section去找到对应这个pfn（或者section number）的mem_section结构体：
#+begin_example
static inline struct mem_section *__nr_to_section(unsigned long nr)
{
	unsigned long root = SECTION_NR_TO_ROOT(nr);

	if (unlikely(root >= NR_SECTION_ROOTS))
		return NULL;

#ifdef CONFIG_SPARSEMEM_EXTREME
	if (!mem_section || !mem_section[root])
		return NULL;
#endif
	return &mem_section[root][nr & SECTION_ROOT_MASK];
}
#+end_example
系统定义了一个全局的mem_section二维数组，里面存放了所有的mem_section结构体的地址，开启了SPARSEMEM_EXTREME配置时，mem_section的空间是动态分配的。首先要找到section number对应哪个root，也就是mem_section的一维：
#+begin_example
#ifdef CONFIG_SPARSEMEM_EXTREME
#define SECTIONS_PER_ROOT       (PAGE_SIZE / sizeof (struct mem_section))
#else
#define SECTIONS_PER_ROOT	1
#endif
#define SECTION_NR_TO_ROOT(sec)	((sec) / SECTIONS_PER_ROOT)
#+end_example
没有开启SPARSEMEM_EXTREME配置时，只有一个root mem_section，否则按每页作为一个root mem_section，那么一个页里能存放多少mem_section就是页的大小除以mem_section结构体的大小，这样__nr_to_section通过SECTION_NR_TO_ROOT先算出对应section number的root mem_section，通过root作为下标取了mem_section的一维后，又通过section number nr和SECTION_ROOT_MASK相于看看是某个root sections里的哪一个section，SECTION_ROOT_MASK定义如下：
#+begin_example
#define SECTION_ROOT_MASK	(SECTIONS_PER_ROOT - 1)
#+end_example
回到get_pageblock_bitmap里，有了mem_section结构体，section_to_usemap返回bitmap图就简单了：
#+begin_example
static inline unsigned long *section_to_usemap(struct mem_section *ms)
{
	return ms->usage->pageblock_flags;
}
#+end_example
usage的初始化在激活section里完成：
#+begin_example
static struct page * __meminit section_activate(int nid, unsigned long pfn,
		unsigned long nr_pages, struct vmem_altmap *altmap,
		struct dev_pagemap *pgmap)
{
    ...
	if (!ms->usage) {
		usage = kzalloc(mem_section_usage_size(), GFP_KERNEL);
		if (!usage)
			return ERR_PTR(-ENOMEM);
		ms->usage = usage;
	}
    ...
}
#+end_example
mem_section.usage这个成员的定义如下：
#+begin_example
struct mem_section_usage {
	struct rcu_head rcu;
#ifdef CONFIG_SPARSEMEM_VMEMMAP
	DECLARE_BITMAP(subsection_map, SUBSECTIONS_PER_SECTION);
#endif
	/* See declaration of similar field in struct zone */
	unsigned long pageblock_flags[0];
};
#+end_example
其中mem_section_usage_size里计算了usage本身的大小再加上pageblock_flags的大小：
#+begin_example
size_t mem_section_usage_size(void)
{
	return sizeof(struct mem_section_usage) + usemap_size();
}
#+end_example
#+begin_example
static unsigned long usemap_size(void)
{
	return BITS_TO_LONGS(SECTION_BLOCKFLAGS_BITS) * sizeof(unsigned long);
}
#+end_example
#+begin_example
#define SECTION_BLOCKFLAGS_BITS \
	((1UL << (PFN_SECTION_SHIFT - pageblock_order)) * NR_PAGEBLOCK_BITS)
#+end_example
从这里可以看到

