kernel/mm/fast_alloc_page/fast_alloc_page.html
<div id="outline-container-org3f0019b" class="outline-3">
<h3 id="org3f0019b"><span class="section-number-3">4.3.</span> 第三部分</h3>
<div class="outline-text-3" id="text-4-3">
<p>
该部分本身的代码其实比较简单了，就是调用rmqueue去伙伴系统里拿内存，这个函数的分析又开到<a href="#org81521bc">下一节</a>去介绍了。
</p>

<p>
第三部分本身的代码如下：
</p>
<pre class="example" id="orgb870c2c">
try_this_zone:
		page = rmqueue(zonelist_zone(ac-&gt;preferred_zoneref), zone, order,
				gfp_mask, alloc_flags, ac-&gt;migratetype);
		if (page) {
			prep_new_page(page, order, gfp_mask, alloc_flags);

			/*
			 * If this is a high-order atomic allocation then check
			 * if the pageblock should be reserved for the future
			 */
			if (unlikely(alloc_flags &amp; ALLOC_HIGHATOMIC))
				reserve_highatomic_pageblock(page, order, zone);

			return page;
		} else {
			if (cond_accept_memory(zone, order))
				goto try_this_zone;

			/* Try again if zone has deferred pages */
			if (deferred_pages_enabled()) {
				if (_deferred_grow_zone(zone, order))
					goto try_this_zone;
			}
		}
	}

	/*
	 * It's possible on a UMA machine to get through all zones that are
	 * fragmented. If avoiding fragmentation, reset and try again.
	 */
	if (no_fallback) {
		alloc_flags &amp;= ~ALLOC_NOFRAGMENT;
		goto retry;
	}

	return NULL;
}
</pre>
<p>
rmqueue本节不介绍，假设rmqueue成功返回了page，那么prep_new_page会做一些准备工作：
</p>
<pre class="example" id="orgcfcd272">
static void prep_new_page(struct page *page, unsigned int order, gfp_t gfp_flags,
							unsigned int alloc_flags)
{
	post_alloc_hook(page, order, gfp_flags);

	if (order &amp;&amp; (gfp_flags &amp; __GFP_COMP))
		prep_compound_page(page, order);

	/*
	 * page is set pfmemalloc when ALLOC_NO_WATERMARKS was necessary to
	 * allocate the page. The expectation is that the caller is taking
	 * steps that will free more memory. The caller should avoid the page
	 * being used for !PFMEMALLOC purposes.
	 */
	if (alloc_flags &amp; ALLOC_NO_WATERMARKS)
		set_page_pfmemalloc(page);
	else
		clear_page_pfmemalloc(page);
}
</pre>
<p>
先看post_alloc_hook函数：
</p>
<pre class="example" id="org802ea6c">
inline void post_alloc_hook(struct page *page, unsigned int order,
				gfp_t gfp_flags)
{
	bool init = !want_init_on_free() &amp;&amp; want_init_on_alloc(gfp_flags) &amp;&amp;
			!should_skip_init(gfp_flags);
	bool zero_tags = init &amp;&amp; (gfp_flags &amp; __GFP_ZEROTAGS);
	int i;

	set_page_private(page, 0);
	set_page_refcounted(page);

	arch_alloc_page(page, order);
	debug_pagealloc_map_pages(page, 1 &lt;&lt; order);

	/*
	 * Page unpoisoning must happen before memory initialization.
	 * Otherwise, the poison pattern will be overwritten for __GFP_ZERO
	 * allocations and the page unpoisoning code will complain.
	 */
	kernel_unpoison_pages(page, 1 &lt;&lt; order);

	/*
	 * As memory initialization might be integrated into KASAN,
	 * KASAN unpoisoning and memory initializion code must be
	 * kept together to avoid discrepancies in behavior.
	 */

	/*
	 * If memory tags should be zeroed
	 * (which happens only when memory should be initialized as well).
	 */
	if (zero_tags) {
		/* Initialize both memory and memory tags. */
		for (i = 0; i != 1 &lt;&lt; order; ++i)
			tag_clear_highpage(page + i);

		/* Take note that memory was initialized by the loop above. */
		init = false;
	}
	if (!should_skip_kasan_unpoison(gfp_flags) &amp;&amp;
	    kasan_unpoison_pages(page, order, init)) {
		/* Take note that memory was initialized by KASAN. */
		if (kasan_has_integrated_init())
			init = false;
	} else {
		/*
		 * If memory tags have not been set by KASAN, reset the page
		 * tags to ensure page_address() dereferencing does not fault.
		 */
		for (i = 0; i != 1 &lt;&lt; order; ++i)
			page_kasan_tag_reset(page + i);
	}
	/* If memory is still not initialized, initialize it now. */
	if (init)
		kernel_init_pages(page, 1 &lt;&lt; order);

	set_page_owner(page, order, gfp_flags);
	page_table_check_alloc(page, order);
	pgalloc_tag_add(page, current, 1 &lt;&lt; order);
}
</pre>
<p>
三个条件共同决定了是否要对分配出来的页面进行初始化：
</p>
<pre class="example" id="org84237c1">
bool init = !want_init_on_free() &amp;&amp; want_init_on_alloc(gfp_flags) &amp;&amp;
                !should_skip_init(gfp_flags);
</pre>
<pre class="example" id="org9791022">
want_init_on_free实现如下：
static inline bool want_init_on_free(void)
{
	return static_branch_maybe(CONFIG_INIT_ON_FREE_DEFAULT_ON,
				   &amp;init_on_free);
}
</pre>
<p>
启用init_on_free后，内核会在释放内存时将所有页面分配器和slab分配器的内存清零。这相当于在内核启动参数中添加init_on_free=1，这时默认开启此功能。可以通过在启动参数中设置init_on_free=0来禁用该功能。与init_on_alloc（在分配时清零内存）类似，init_on_free的目的是防止未初始化的堆内存问题。当启用init_on_free时，释放的内存会立刻被清零。这有效防止了多种与未初始化内存相关的漏洞，例如：堆内容泄露：清零后，即使后续程序意外访问到释放的内存，也不会看到之前的内容。内存取证和冷启动攻击：攻击者即使尝试从释放的内存中恢复数据，也无法获取实际内容。启用init_on_free会对性能产生负面影响，主要原因是清零操作会触碰到本来已经“冷”的内存区域，影响缓存效率。性能损耗范围：大多数情况下，性能影响约为3-5%。在某些特定的合成工作负载（如专门测试内存分配和释放的基准测试）中，性能损耗可能高达8%。如果系统需要加强对内存数据的保护（如防止敏感数据泄露或提高系统安全性），可以启用init_on_free。对性能敏感的场景下，则可能需要权衡利弊，选择关闭此功能。在笔者的环境里这个功能是关闭的。
</p>

<p>
继续看下一个条件：
</p>
<pre class="example" id="orgb41d127">
DECLARE_STATIC_KEY_MAYBE(CONFIG_INIT_ON_ALLOC_DEFAULT_ON, init_on_alloc);

#define static_branch_maybe(config, x)					\
	(IS_ENABLED(config) ? static_branch_likely(x)			\
			    : static_branch_unlikely(x))

static inline bool want_init_on_alloc(gfp_t flags)
{
	if (static_branch_maybe(CONFIG_INIT_ON_ALLOC_DEFAULT_ON,
				&amp;init_on_alloc))
		return true;
	return flags &amp; __GFP_ZERO;
}
</pre>
<p>
这个配置打开时，所有页面分配器出来的页面或是slab分配器得到的内存在分配的时候都会被清零，大多数时候该功能对性能的影响在1%，某些专门合成的测试负载可能会有高达7%的性能损失。
</p>

<p>
这个配置在笔者的环境是打开的。最后一个条件主要是针对arm64环境的硬件内存标签功能，它依赖于ARMv8.5+提供的Memory Tagging Extension，本文不详细探究，总之第三个条件一般也是true，所以在笔者的环境就是init为true。
</p>

<p>
再往下set_page_private将page: private成员给赋值成0，因为这个成员可能表示之前使用者有意义的值，比如buffer head可以使用它，也可以表示一个swap_entry_t，当该页面在伙伴系统里，又可以存放页面的order信息，所以在分配完成返回给用户前，先将这个值清0。
</p>

<p>
set_page_refcounted函数又设置page: _refcount为1。在设置前判断当前页面应该不是tail page，因为tail page不能单独拿出来分配，操作tail page只能通过head page，如果一个页面是tail page，那么page: compound_head的bit 0被设置为1。
</p>

<p>
再往下是unpoision页面。poision/unposion页面是内核内存管理的一个安全功能，在释放页面时，以特定的毒化模式串去填充页面，而在分配页面时又会去验证是不是这样的毒化模式串，这样如果内存页面被非法的访问修改过，就会在分配页面检测毒化模式串时被发现。这个配置CONFIG_PAGE_POISONING在笔者的环境上是打开的。
</p>

<pre class="example" id="org73e7699">
kernel_unpoison_pages(page, 1 &lt;&lt; order);

static inline void kernel_unpoison_pages(struct page *page, int numpages)
{
	if (page_poisoning_enabled_static())
		__kernel_unpoison_pages(page, numpages);
}

void __kernel_unpoison_pages(struct page *page, int n)
{
	int i;

	for (i = 0; i &lt; n; i++)
		unpoison_page(page + i);
}

static void unpoison_page(struct page *page)
{
	void *addr;

	addr = kmap_local_page(page);
	kasan_disable_current();
	/*
	 * Page poisoning when enabled poisons each and every page
	 * that is freed to buddy. Thus no extra check is done to
	 * see if a page was poisoned.
	 */
	check_poison_mem(page, kasan_reset_tag(addr), PAGE_SIZE);
	kasan_enable_current();
	kunmap_local(addr);
}

static void check_poison_mem(struct page *page, unsigned char *mem, size_t bytes)
{
	static DEFINE_RATELIMIT_STATE(ratelimit, 5 * HZ, 10);
	unsigned char *start;
	unsigned char *end;

	start = memchr_inv(mem, PAGE_POISON, bytes);
	if (!start)
		return;

	for (end = mem + bytes - 1; end &gt; start; end--) {
		if (*end != PAGE_POISON)
			break;
	}

	if (!__ratelimit(&amp;ratelimit))
		return;
	else if (start == end &amp;&amp; single_bit_flip(*start, PAGE_POISON))
		pr_err("pagealloc: single bit error\n");
	else
		pr_err("pagealloc: memory corruption\n");

	print_hex_dump(KERN_ERR, "", DUMP_PREFIX_ADDRESS, 16, 1, start,
			end - start + 1, 1);
	dump_stack();
	dump_page(page, "pagealloc: corrupted page details");
}
</pre>
<p>
可以看到这里针对每个页面都调用了memchr_inv函数来检查其里的内容是不是毒化模式串PAGE_POISON，它一般是0xaa，memchr_inv的作用就是检查自start起始，如果某个地址不是0xaa，就返回这个串的地
址了，判断完所有内容都是0xaa的话，就返回NULL。
</p>

<p>
中间关于tag/kasan的处理本文不详细描述了。接下来主要想介绍下set_page_owner函数，尽管CONFIG_PAGE_OWNER在笔者的环境上没有打开，但这个功能是一个用于跟踪页面被哪个进程使用的，对于调试可能有很大帮助。
</p>

<p>
如果开启了CONFIG_PAGE_OWNER就会定义上page_owner_ops这个操作集。
</p>
<pre class="example" id="org52c5e41">
static struct page_ext_operations *page_ext_ops[] __initdata = {
#ifdef CONFIG_PAGE_OWNER
	&amp;page_owner_ops,
#endif
...
};
</pre>
<p>
page_owner_ops里的init成员为函数init_page_owner，它会调用：
</p>
<pre class="example" id="org4f7707e">
static_branch_enable(&amp;page_owner_inited);
</pre>
<p>
去使能page_owner_inited。而mm_core_init-&gt;page_ext_init-&gt;invoke_init_callbacks会对上述的init函数进行调用：
</p>
<pre class="example" id="org58f87b9">
static void __init invoke_init_callbacks(void)
{
	int i;
	int entries = ARRAY_SIZE(page_ext_ops);

	for (i = 0; i &lt; entries; i++) {
		if (page_ext_ops[i]-&gt;init)
			page_ext_ops[i]-&gt;init();
	}
}
</pre>
<p>
这样在打开了配置CONFIG_PAGE_OWNER时，page_owner_inited量就会使能。这样set_page_owner函数就可以调用__set_page_owner函数了：
</p>
<pre class="example" id="org3905572">
static inline void set_page_owner(struct page *page,
			unsigned short order, gfp_t gfp_mask)
{
	if (static_branch_unlikely(&amp;page_owner_inited))
		__set_page_owner(page, order, gfp_mask);
}
</pre>
<p>
如果开启了CONFIG_PAGE_OWNER，那么每个page关联到一个page_ext结构体，这个page_ext可以解释为一个地址，这样就可以在这个地址存储当前页面的一些额外的信息了，所谓extend就是这个意思。这个配置用于跟踪内核中每个页面的分配者和调用链。如果启用此特性，它会记录每个页面的分配和释放的调用堆栈，从而帮助开发者排查可能的内存泄漏或未释放的页面（例如裸调用 alloc_page(s) 而未释放）。
</p>

<p>
__set_page_owner函数里，通过page_ext_get-&gt;lookup_page_ext去获得当前页面对应的page_ext，所有的page_ext结构体在每个内存节点里有一个开始的基址base，就是pglist_data: node_page_ext成员，所谓获取page对应的page_ext，其实就是看当前页面对应当前节点起始页面的偏移是多少，取出相对于基址base偏移这么多的page_ext就行。而所有page所占的的page_ext结构体的空间，在alloc_node_page_ext函数里初始化的时候通过memblock_alloc_try_node去获得，并给到pglist_data: node_page_ext：
</p>
<pre class="example" id="org265c130">
static int __init alloc_node_page_ext(int nid)
{
	struct page_ext *base;
	unsigned long table_size;
	unsigned long nr_pages;

	nr_pages = NODE_DATA(nid)-&gt;node_spanned_pages;
	if (!nr_pages)
		return 0;

	/*
	 * Need extra space if node range is not aligned with
	 * MAX_ORDER_NR_PAGES. When page allocator's buddy algorithm
	 * checks buddy's status, range could be out of exact node range.
	 */
	if (!IS_ALIGNED(node_start_pfn(nid), MAX_ORDER_NR_PAGES) ||
		!IS_ALIGNED(node_end_pfn(nid), MAX_ORDER_NR_PAGES))
		nr_pages += MAX_ORDER_NR_PAGES;

	table_size = page_ext_size * nr_pages;

	base = memblock_alloc_try_nid(
			table_size, PAGE_SIZE, __pa(MAX_DMA_ADDRESS),
			MEMBLOCK_ALLOC_ACCESSIBLE, nid);
	if (!base)
		return -ENOMEM;
	NODE_DATA(nid)-&gt;node_page_ext = base;
	total_usage += table_size;
	memmap_boot_pages_add(DIV_ROUND_UP(table_size, PAGE_SIZE));
	return 0;
}
</pre>
<p>
memblock是内核里相对于伙伴系统的另一个内存管理基址，它在伙伴系统还未就绪的时候使用，关于它的详细分析见笔者另外的文章，总之page_ext所需的空间是在启动时事先通过memblock预分配好的。
</p>

<p>
有了page_ext，就可以通过get_page_owner去获得page_owner结构体了，page_ext可能不止被page_owner使用，page owner是page_ext的使用者之一（page owner这个功能就作为page ext的client），__set_page_owner-&gt;__update_page_owner_handle，在后者这个函数里，先通过get_page_owner将page_ext转换为page_owner结构体，然后就可以往里面存信息了，由于每个页面关联一个page_ext，page_ext又可以关联到page_owner，所以最终其实就记录了每个页面由谁持有，且__set_page_owner-&gt;save_stack还保存了调用栈用于分析：
</p>
<pre class="example" id="org3ff596a">
noinline void __set_page_owner(struct page *page, unsigned short order,
					gfp_t gfp_mask)
{
	struct page_ext *page_ext;
	u64 ts_nsec = local_clock();
	depot_stack_handle_t handle;

	handle = save_stack(gfp_mask);

	page_ext = page_ext_get(page);
	if (unlikely(!page_ext))
		return;
	__update_page_owner_handle(page_ext, handle, order, gfp_mask, -1,
				   ts_nsec, current-&gt;pid, current-&gt;tgid,
				   current-&gt;comm);
	page_ext_put(page_ext);
	inc_stack_record_count(handle, gfp_mask, 1 &lt;&lt; order);
}
</pre>
<pre class="example" id="orgfa13091">
static inline void __update_page_owner_handle(struct page_ext *page_ext,
					      depot_stack_handle_t handle,
					      unsigned short order,
					      gfp_t gfp_mask,
					      short last_migrate_reason, u64 ts_nsec,
					      pid_t pid, pid_t tgid, char *comm)
{
	int i;
	struct page_owner *page_owner;

	for (i = 0; i &lt; (1 &lt;&lt; order); i++) {
		page_owner = get_page_owner(page_ext);
		page_owner-&gt;handle = handle;
		page_owner-&gt;order = order;
		page_owner-&gt;gfp_mask = gfp_mask;
		page_owner-&gt;last_migrate_reason = last_migrate_reason;
		page_owner-&gt;pid = pid;
		page_owner-&gt;tgid = tgid;
		page_owner-&gt;ts_nsec = ts_nsec;
		strscpy(page_owner-&gt;comm, comm,
			sizeof(page_owner-&gt;comm));
		__set_bit(PAGE_EXT_OWNER, &amp;page_ext-&gt;flags);
		__set_bit(PAGE_EXT_OWNER_ALLOCATED, &amp;page_ext-&gt;flags);
		page_ext = page_ext_next(page_ext);
	}
}
</pre>
<p>
这里可以看到各种信息被保存到了page_owner，比较典型的比如调用者的pid。关于page owner和page ext的更多细节可以参考笔者其它文章。到这里post_alloc_hook就介绍的差不多了。回到prep_new_page函数：
</p>
<pre class="example" id="org76a3836">
if (order &amp;&amp; (gfp_flags &amp; __GFP_COMP))
	prep_compound_page(page, order);
</pre>
<p>
如果gfp_flags设置了__GFP_COMP，那么就会调用prep_compound_page来处理head/tail page的逻辑。对于高阶的页面分配，可以组织这些连续的多个页面为复合页，高阶分配的第一页，称为head page，并设置了PG_head标志。除了head page以外的页称为tail pages，它们通过page-&gt;compound_head指向head page。第一个tail page的-&gt;compound_order字段记录了分配的阶数（order）。这意味着只有高阶分配（order &gt; 0）的页才会被标记为compound page。tail page的compound_head的最低位（bit 0）表示PageTail() 状态（即是否是tail page），compound_head的其余部分存储了指向head page的指针。
</p>

<p>
高阶分配和compound page是有区别的，高阶多页分配是指分配2^order个连续的物理页（即高阶页）。分配高阶页时，是否启用compound page的逻辑，取决于分配时是否指定了__GFP_COMP标志。如果没有指定 __GFP_COMP，这些高阶页仅仅是分配了一块连续的物理内存，而没有特殊的结构或元数据（例如head/tail page）关联这些页。每个页只是独立的，和普通单页没有什么不同，内核无法识别它们属于同一个高阶分配。
</p>

<pre class="example" id="org60a59cb">
void prep_compound_page(struct page *page, unsigned int order)
{
	int i;
	int nr_pages = 1 &lt;&lt; order;

	__SetPageHead(page);
	for (i = 1; i &lt; nr_pages; i++)
		prep_compound_tail(page, i);

	prep_compound_head(page, order);
}
</pre>
<p>
先通过__SetPageHead设置head页面的PG_head。
<a id="org81521bc"></a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgd88a683" class="outline-2">
<h2 id="orgd88a683"><span class="section-number-2">5.</span> rmqueue</h2>
</div>

<div id="outline-container-org59ac59f" class="outline-2">
<h2 id="org59ac59f"><span class="section-number-2">6.</span> 附节</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orge835b8e" class="outline-3">
<h3 id="orge835b8e"><span class="section-number-3">6.1.</span> get_vma_policy生成ilx</h3>
<div class="outline-text-3" id="text-6-1">
<p>
<a id="org698f364"></a>
</p>
</div>
</div>
</div>
<div id="outline-container-org8fa76d7" class="outline-2">
<h2 id="org8fa76d7"><span class="section-number-2">7.</span> rmqueue</h2>
</div>
<div id="outline-container-org0ffaef9" class="outline-2">
<h2 id="org0ffaef9"><span class="section-number-2">8.</span> 附节</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgab61376" class="outline-3">
<h3 id="orgab61376"><span class="section-number-3">8.1.</span> get_vma_policy生成ilx</h3>
<div class="outline-text-3" id="text-8-1">
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cauchy(pqy7172@gmail.com)</p>
<p class="date">Created: 2025-01-05 Sun 14:00</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
